---
layout: sivu
tagline: Cloudplatform
title: Rekisteriseloste
---
<h1>Rekisteri- ja tietosuojaseloste</h1>
<p>Henkil&ouml;tietolaki(523/99) 10 ja 24&sect;</p>
<p>Laatimisp&auml;iv&auml; 15.6.2010</p>
<h2>1. Rekisterin nimi</h2>
<p>Asiakasrekisteri</p>
<h2>2. Rekisterinpit&auml;j&auml;</h2>
<p>Planeetta Internet Oy<br />
Y-tunnus: 1753494-9<br />
Mannerheimintie 105<br />
00280 Helsinki<br />
puh. 010 5251 440<br />
e-mail <a href="mailto:info@planeetta.fi">info@planeetta.fi</a>
</p>
<h2>3. Vastaava henkil&ouml;</h2>
<p>toimitusjohtaja Lauri Kasti<br />
puh. 010 5251 458
</p>
<h2>4. Henkil&ouml;tietojen k&auml;sittelyn tarkoitus</h2>
<p>Yrityksen asiakastietojen hallinta, markkinointi, laskutuksen seuranta, verkkorekisteritunnusten rekister&ouml;inti asiakkaille ja asiakkaiden palvelutilausten hallinta ja yll&auml;pito.</p>
<h2>5. Rekisterin tietosis&auml;lt&ouml;</h2>
<p>Asiakkaan tiedot:</p>
<p>Yritysasikkaista:   y-tunnus, osoite ja muut yhteystiedot, yhteyshenkil&ouml;iden nimet.</p>
<p>Yksityisasiakkasta: Nimi, syntym&auml;aika, osoite ja muut yhteystiedot (henkil&ouml;tunnus voidaan tarvita esim. verkkotunnuksen rekister&ouml;inti&auml; varten, mutta sit&auml; ei tallenneta rekisteritietoihin)</p>
<p>Kaikista asiakkaista: tiedot tilatuista palveluista, palveluiden k&auml;ytt&ouml;tiedot ja laskutustiedot.</p>
<h2>6. S&auml;&auml;nn&ouml;nmukaiset tietol&auml;hteet</h2>
<p>Asiakkaalta saadut tiedot tilauksen yhteydess&auml;.</p>
<p>Planeetta Internetin omista k&auml;yt&ouml;nvalvontaj&auml;rjestelm&auml;st&auml;, laskutusj&auml;rjestelm&auml;st&auml; ja kirjanpidosta saadut tiedot.</p>
<h2>7. Tietojen luovutukset ja siirto ETA-alueen ulkopuolelle</h2>
<p>Tietoja k&auml;ytett&auml;&auml;n ainoastaan Planeetta Internetin omassa sis&auml;isess&auml; k&auml;yt&ouml;ss&auml; palveluiden hallintaan, laskutuksen seurantaan ja markkinoinnin tietol&auml;hteen&auml;.</p>
<p>Mit&auml;&auml;n tietoja ei luovuteta rekisterist&auml; kolmansille tahoille Suomessa, EU tai ETA -alueella tai niiden ulkopuolelle. Tietoja voidaan luovuttaa viranomaisille silloin, kuin n&auml;ill&auml; on lakiin perustuva yksil&ouml;ity vaatimus saada tietoja rekisterist&auml;.</p>
<h2>8. Rekisterin suojauksen perusteet</h2>
<p>Manuaalinen aineisto: Tietoja ei s&auml;ilytet&auml; manuaalisena aineistona kuten paperitulosteina.</p>
<p>S&auml;hk&ouml;isess&auml; muodossa olevat tiedot ovat Planeetta Internetin omassa sis&auml;isess&auml; j&auml;rjestelm&auml;ss&auml; tallennettuna. J&auml;rjestelm&auml; on suojattu erilaisin suojausmenetelmin. Rekisteri&auml; p&auml;&auml;sev&auml;t k&auml;ytt&auml;m&auml;&auml;n Planeetta Internetin ty&ouml;ntekij&auml;t henkil&ouml;kohtaisella k&auml;ytt&auml;j&auml;tunnuksellaan vain silt&auml; osin kuin heill&auml; on tarve saada ty&ouml;teht&auml;vi&auml;ns&auml; varten tietoja rekisterist&auml;.</p>
<h2>9. Tarkastusoikeus ja oikeus vaatia tietojen korjaamista</h2>
<p>Asiakkaalla on oikeus saada rekisterinpit&auml;j&auml;lt&auml; tietoonsa, mit&auml; tietoja h&auml;nest&auml; on tallennettuna rekisterinpit&auml;j&auml;n yll&auml;pit&auml;miss&auml; rekistereiss&auml; ja oikeus vaatia virheellisten tietojen korjaamista.</p>
