---
layout: sivu
tagline: Cloudplatform
title: Sopimusehdot
---
<p>Voit ladata PDF-muotoisen version sopimusehdoista tulostamista varten <a href="/sopimusehdot/planeetta_internet_sopimusehdot_2010.pdf" target="_blank">tästä</a>.</p>
<hr />
<h1>Planeetta Internet Oy Yleiset Sopimusehdot 2010</h1>
<h2>1 Sopimusehtojen voimaantulo</h2>
<p>N&auml;m&auml; toimitusehdot tulevat voimaan 1.7.2010 ja ovat voimassa toistaiseksi.
N&auml;iden Yleisten sopimusehtojen kanssa samanaikaisesti tulevat voimaan
Planeetta Internetin palvelu- ja tuotekohtaiset erityiset sopimusehdot. N&auml;m&auml; korvaavat
kaikki aikaisemmin voimassa olleet yleiset ja erityiset sopimusehdot.</p>
<p>N&auml;it&auml; sopimusehtoja sovelletaan 1.7.2010 j&auml;lkeen asiakkaiden
kanssa solmittaviin sopimuksiin. Vanhojen asiakkaiden jo voimassaoleviin sopimuksiin
n&auml;it&auml; sopimusehtoja sovelletaan 1.8.2010 lukien.</p>
<p><strong>Näihin sopimusehtoihin on lisätty <a href="#tietosuojaehdot">tietosuojaehtoliite</a>, jota sovelletaan 25.5.2018 alkaen.</strong></p>
<h2>2 Yleisten Sopimusehtojen soveltaminen</h2>
<p>N&auml;it&auml; yleisi&auml; sopimusehtoja sovelletaan Planeetta Internet
Oy:n tai sen kanssa samaan konserniin kuuluvan yhti&ouml;n (j&auml;ljemp&auml;n&auml; Planeetta
Internet) asiakkaalle toimittamiin palveluihin. Palvelut voivat sis&auml;lt&auml;&auml; liittymi&auml; ja
viestint&auml;palveluja sek&auml; muita Planeetta Internetin asiakkaille tarjoamia
palveluja.</p>
<p>N&auml;m&auml; sopimusehdot liitet&auml;&auml;n asiakkaan ja Planeetta Internetin
v&auml;liseen sopimukseen ja niit&auml; sovelletaan, elleiv&auml;t asiakas
ja Planeetta Internet kirjallisesti toisin sovi. N&auml;iden sopimusehtojen
ohella sovellettaviksi tulevat Planeetta Internetin Palvelukohtaiset erityiset
sopimusehdot.</p>
<p>Asiakirjojen etusijaj&auml;rjestys on seuraava:
<ol>
<li>Sopimus tai tilausvahvistus</li>
<li>Sopimuksen tai tilausvahvistuksen liitteen&auml; oleva palvelukuvaus</li>
<li>Palvelukohtaiset Erityiset Sopimusehdot</li>
<li>n&auml;m&auml; Yleiset Sopimusehdot liitteineen</li>
<li>Hinnasto</li>
</ol></p>
<h2>3 Sopimuksen syntyminen ja siirt&auml;minen</h2>
<p>3.1 Osapuolet tekev&auml;t palvelusta kirjallisen sopimuksen. Sopimus syntyy,
kun osapuolet ovat allekirjoittaneet sopimuksen tai kun Planeetta Internet
on hyv&auml;ksynyt asiakkaan tilauksen toimittamalla asiakkaalle kirjallisen
tilausvahvistuksen ja asiakas on toimittanut Planeetta Internetille mahdollisesti
vaadittavan avaus- tai ennakkomaksun.</p>
<p>3.2 Asiakas ja Planeetta Internet voivat tehd&auml; sopimuksen kirjallisesti
tai kirjalliseen rinnastettavalla, Planeetta Internetin hyv&auml;ksym&auml;ll&auml; tavalla
s&auml;hk&ouml;isesti, vastaavasti my&ouml;s tilaus voidaan ottaa vastaan
s&auml;hk&ouml;isesti Planeetta Internetin palvelusivujen kautta tai s&auml;hk&ouml;postilla
ja tilausvahvistus voidaan toimittaa s&auml;hk&ouml;postitse. Sopimus on voimassa
toistaiseksi tai m&auml;&auml;r&auml;tyn sopimusajan.</p>
<p>3.3 Planeetta Internetill&auml; on oikeus ennen sopimuksen hyv&auml;ksymist&auml; tarkastaa
asiakkaan luottotiedot ja vaatia sopimuksen mukaisista maksuista kohtuullista
ennakkomaksua tai vakuutta.</p>
<h3>Sopimuksen siirt&auml;minen</h3>
<p>3.4 Planeetta Internetill&auml; on ilman asiakkaan suostumusta oikeus siirt&auml;&auml; sopimus
kokonaan tai osittain Planeetta Internetin kanssa samaan konserniin kuuluvalle
taholle sek&auml; kolmannelle, jolle sopimuksen tarkoittama liiketoiminta
siirtyy. Planeetta Internet ilmoittaa asiakkaalle siirrosta etuk&auml;teen.</p>
<p>3.5 Planeetta Internetill&auml; on lis&auml;ksi oikeus siirt&auml;&auml; sopimukseen
perustuvat saatavansa kolmannelle. Saatavien siirtoa koskevan ilmoituksen
j&auml;lkeen maksut voidaan p&auml;tev&auml;sti suorittaa ainoastaan siirronsaajalle.</p>
<p>3.6 Asiakkaalla ei ole oikeutta siirt&auml;&auml; sopimusta ilman Planeetta
Internetin kirjallista suostumusta.</p>
<h2>4 Palvelun toimittaminen</h2>
<h3>Toimitusajankohta</h3>
<p>4.1 Planeetta Internetin on aloitettava palvelun toimittaminen sovittuna
toimitusp&auml;iv&auml;n&auml; tai sovitun ajan kuluessa. Jos toimitusaikaa
tai &ndash;p&auml;iv&auml;&auml; ei ole sovittu, Planeetta Internet toimittaa
palvelun kohtuullisen ajan kuluessa sopimuksen allekirjoittamisesta tai tilausvahvistuksesta.</p>
<p>4.2 Palvelu on toimitettu, kun Planeetta Internet ilmoittaa palvelun olevan
k&auml;ytett&auml;viss&auml;.</p>
<p>4.3 Mik&auml;li toimitus viiv&auml;styy asiakkaasta tai kolmannesta osapuolesta,
mukaan lukien lisenssinantaja, televerkkoyhteyksi&auml; toimittava teleyritys
tai Planeetta Internetin p&auml;&auml;mies, johtuvasta seikasta, toimitusaikaa
jatketaan, kunnes toimituksen est&auml;v&auml; seikka on korjattu tai poistunut.</p>
<p>4.4 Planeetta Internetill&auml; on oikeus peri&auml; palveluun kohdistuvat
maksut my&ouml;s silt&auml; ajalta, kun palvelua ei ole voitu toimittaa asiakkaasta
johtuvasta syyst&auml;.</p>
<p>4.5 Jos palvelu toimitetaan asiakkaasta johtuvasta syyst&auml; sovitun toimitusajankohdan
j&auml;lkeen, Planeetta Internetill&auml; on oikeus valita sopiva toimitusajankohta.</p>
<h3>Asiakkaan my&ouml;t&auml;vaikutusvelvollisuus</h3>
<p>4.6 Asiakkaan tulee j&auml;rjest&auml;&auml; Planeetta Internetille p&auml;&auml;sy
tarpeellisiin laitetiloihin sek&auml; muutoinkin my&ouml;t&auml;vaikuttaa
parhaan kykyns&auml; mukaan palvelun toimittamiseen</p>
<p>4.7 Asiakkaan on annettava Planeetta Internetille riitt&auml;v&auml;t ja
oikeat tiedot toimitusta ja palvelun yll&auml;pitoa varten ja ilmoitettava
Planeetta Internetille hyviss&auml; ajoin muutoksista antamissaan tiedoissa.</p>
<p>4.8 Asiakas vastaa Planeetta Internetille antamistaan tiedoista, ohjeista
ja m&auml;&auml;r&auml;yksist&auml; sek&auml; n&auml;iden mukaisesti suoritettujen
palveluiden soveltuvuudesta k&auml;ytt&ouml;tarkoitukseensa.</p>
<h3>Palveluiden k&auml;ytt&ouml;&ouml;notto ja toimituksen hyv&auml;ksyminen</h3>
<p>4.9 Jos palvelu sis&auml;lt&auml;&auml; mahdollisuuden tallentaa tietoa,
Planeetta Internetin vastuu tietojen tallessa pit&auml;misest&auml; alkaa
siit&auml; hetkest&auml;, kun tiedot on onnistuneesti tallennettu osana palvelun
k&auml;ytt&ouml;&ouml;n siirtymist&auml; ja Planeetta Internet on ilmoittanut
asiakkaalle, ett&auml; tallentaminen on onnistunut.</p>
<p>4.10 Asiakkaan on v&auml;litt&ouml;m&auml;sti toimituksen j&auml;lkeen tarkastettava
palvelu ja siihen mahdollisesti liittyvien laitteiden toimivuus ja reklamoitava
toimimattomuudesta tai muusta toimituksen tai palvelun puutteesta tai virheest&auml; v&auml;litt&ouml;m&auml;sti.
Jos asiakas ei ole ilmoittanut virheist&auml; nelj&auml;ntoista (14) p&auml;iv&auml;n
kuluessa palvelun toimittamisesta tai on ottanut palvelun sen normaalin tarkoituksen
mukaiseen k&auml;ytt&ouml;&ouml;n (tuotantok&auml;ytt&ouml;), katsotaan palvelu
hyv&auml;ksytyksi.</p>
<p>4.11 Reklamaatiosta huolimatta toimitus katsotaan hyv&auml;ksytyksi, ellei
palvelussa ole kohdan 6.1 mukaista virhett&auml;. Asiakas vastaa vaatimiensa
tarkastuksen sek&auml; palveluun kuulumattomien testausten kustannuksista.</p>
<p>4.12 Palvelu katsotaan my&ouml;s hyv&auml;ksytyksi heti, kun se on osapuolten
yhteisess&auml; k&auml;ytt&ouml;&ouml;nottotestiss&auml; todettu toimivaksi.
Sellaiset puutteellisuudet tai viat, jotka eiv&auml;t olennaisesti haittaa
laitteen tai palvelun k&auml;ytt&auml;mist&auml;, eiv&auml;t ole esteen&auml; toimituksen
hyv&auml;ksymiselle, mutta Planeetta Internet on velvollinen ilman aiheetonta
viivytyst&auml; korjaamaan ne.</p>
<p>4.13 Planeetta Internet ja asiakas voivat sopia palvelun koek&auml;ytt&ouml;ajasta.
Koek&auml;ytt&ouml;ajalla Planeetta Internetill&auml; ei ole mit&auml;&auml;n
velvoitteita eik&auml; vahingonkorvausvastuuta. Asiakas ei ole velvollinen
maksamaan palvelumaksua koek&auml;ytt&ouml;ajalta, mutta asiakkaan on muutoin
noudatettava sopimusta ja n&auml;it&auml; ehtoja.</p>
<h2>5 Palvelun sis&auml;lt&ouml; ja palveluun sovellettavat erityiset ehdot.</h2>
<p>5.1 Palvelun sis&auml;lt&ouml; ja siihen sovellettavat erityiset ehdot m&auml;&auml;r&auml;ytyv&auml;t
sopimuksen, tilausvahvistuksen ja sen liittein&auml; olevien palvelukuvauksen
mukaisesti ja ko. palvelua koskevien erityisten sopimusehtojen mukaisesti.</p>
<p>5.2 Esittelylehtisiss&auml;, Internet-sivuilla tai muussa markkinointimateriaalissa
esitetyt tiedot eiv&auml;t ole palvelun m&auml;&auml;rityksi&auml;, eiv&auml;tk&auml; sido
Planeetta Interneti&auml;.</p>
<p>5.3 Palvelu, ohjelmistot ja k&auml;ytt&ouml;oikeus ohjelmistoihin toimitetaan &rdquo;sellaisinaan&rdquo; ja &rdquo;sellaisina
kuin ne ovat saatavilla&rdquo;. Palvelun k&auml;ytt&ouml; pyrit&auml;&auml;n
tarjoamaan jatkuvasti periaatteen 24/7 mukaisesti pois lukien tilap&auml;iset
palvelukatkokset, jotka voivat johtua palvelun yll&auml;pito-, p&auml;ivitys-
tai korjaustoimenpiteist&auml; tai muista vastaavista katkoksista.</p>
<h3>Palvelun tuottaminen ja muutokset.</h3>
<p>5.4 Planeetta Internetill&auml; on oikeus tuottaa sopimuksen mukainen palvelu
parhaaksi katsomallaan tavalla ja k&auml;ytt&auml;&auml; palvelun tuottamisessa
alihankkijoita.</p>
<p>5.5 Johtuen alan kehityksest&auml; palvelu asiakkaan tilaamien palveluiden
k&auml;ytett&auml;vyys eri palvelualustoilla, k&auml;ytt&ouml;j&auml;rjestelmiss&auml; ja
matkaviestimiss&auml; saattaa muuttua, johtuen mm. k&auml;ytt&ouml;j&auml;rjestelmien
ja ohjelmien p&auml;ivityksist&auml; ja muutoksista.</p>
<p>5.6 Planeetta Internetill&auml; on oikeus tehd&auml; palvelun tekniikkaan
ja k&auml;ytt&ouml;&ouml;n vaikuttavia muutoksia. Jos t&auml;llaiset muutokset
edellytt&auml;v&auml;t muutoksia asiakkaan laitteisiin tai ohjelmistoihin,
asiakkaan tulee omalla kustannuksellaan huolehtia t&auml;llaisista muutoksista.</p>
<p>5.7 Planeetta Internet pyrkii ilmoittamaan asiakkaaseen vaikuttavista palvelun
muutoksista kohtuullisessa ajassa etuk&auml;teen.</p>
<h2>6 Palvelun yll&auml;pit&auml;minen ja palvelun virhe</h2>
<p>6.1 Palvelussa katsotaan olevan virhe, jos se poikkeaa sopimuksessa, tilausvahvistuksessa
tai palvelukuvauksessa m&auml;&auml;ritellyist&auml; ominaisuuksista, edellytt&auml;en
ett&auml; t&auml;m&auml; poikkeama vaikuttaa palvelun k&auml;ytt&auml;miseen.</p>
<p>6.2 Mahdollista tietoliikenneyhteyden ajoittaista tai jatkuvaa hitautta
ei ole pidett&auml;v&auml; palvelun virheen&auml;, jos asiakkaan hankkima
kapasiteetti on riitt&auml;m&auml;t&ouml;n asiakkaan k&auml;ytt&ouml;&ouml;n
n&auml;hden. Planeetta Internet toteaa nimenomaisesti, etteiv&auml;t viestint&auml;palvelut
ole luonteeltaan koskaan t&auml;ysin h&auml;iri&ouml;tt&ouml;mi&auml;, ellei
asiakkaan kanssa ole erikseen kirjallisesti sovittu erityisist&auml; j&auml;rjestelyist&auml;,
jotka voivat johtaa l&auml;hes t&auml;ydelliseen h&auml;iri&ouml;tt&ouml;myyteen.</p>
<h3>Palvelun yll&auml;pit&auml;minen ja virheiden korjaaminen.</h3>
<p>6.3 Planeetta Internet yll&auml;pit&auml;&auml; palvelun k&auml;ytt&ouml;kunnossa
sopimuksen mukaisesti ja korjaa palveluissa olevat virheet kohtuullisessa
ajassa normaalin ty&ouml;ajan puitteissa.(ei lauantaisin) kello 9.00 - 17.00,
ellei sopimuksessa, tilausvahvistuksessa tai palvelukuvauksessa ole muutoin
sovittu. Normaalin ty&ouml;ajan ulkopuolella kiireellisist&auml; korjaust&ouml;ist&auml; sovitaan
erikseen.</p>
<h3>Palvelun tilap&auml;iset keskeytykset.</h3>
<p>6.4 Planeetta Internetill&auml; on oikeus tilap&auml;isesti sulkea tai keskeytt&auml;&auml; palvelu,
jos k&auml;ytt&ouml;katkos on tarpeen palvelun tai sen osan korjausta, p&auml;ivitt&auml;mist&auml; tai
yll&auml;pitoa varten taikka palvelun k&auml;ytett&auml;vyyden tai toimivuuden
varmistamiseksi.</p>
<p>6.5 T&auml;ll&ouml;in Planeetta Internet toimii siten, ett&auml; keskeytys
j&auml;&auml; lyhytaikaiseksi ja siit&auml; aiheutuu asiakkaalle mahdollisimman
v&auml;h&auml;n haittaa. Planeetta Internet tiedottaa asiakkaalle keskeytyksest&auml; mahdollisuuksien
mukaan etuk&auml;teen.</p>
<h3>Yll&auml;pidon rajoitukset.</h3>
<p>6.6 Yll&auml;pito ei kata sellaisen virheen korjausta, joka on aiheutunut
Planeetta Internetist&auml; riippumattomasta tai asiakkaan vastuulla olevasta
syyst&auml;, kuten:</p>
<p>a) palvelun virheellisest&auml; k&auml;yt&ouml;st&auml; taikka huolimattomuudesta
tai laiminly&ouml;nnist&auml; palvelun k&auml;ytt&ouml;&auml; tai huoltoa
koskevien ohjeiden taikka palvelun ymp&auml;rist&ouml;vaatimusten noudattamisessa
tai</p>
<p>b) palvelun piiriin kuulumattomista laitteista, teleyhteyksist&auml;, ohjelmistoista
tai m&auml;&auml;rityksist&auml; taikka muun kuin Planeetta Internetin tekem&auml;st&auml; muutoksesta,
korjauksesta, liit&auml;nn&auml;st&auml; tai k&auml;ytt&auml;m&auml;st&auml; tarvikkeesta.</p>
<h2>7 Asiakkaan vikailmoitus ja reklamointivelvollisuus</h2>
<p>7.1 Asiakas on velvollinen ilmoittamaan virheest&auml; heti sen havaittuaan.
Vikailmoitus tulee tehd&auml; joko s&auml;hk&ouml;postitse tai Planeetta Internetin
asiakassivuston kautta. Planeetta Internet pid&auml;tt&auml;&auml; itsell&auml;&auml;n
oikeuden laskuttaa asiakasta virheellisen h&auml;iri&ouml;ilmoituksen aiheuttamasta
tarpeettomasta ty&ouml;st&auml;.</p>
<p>7.2 Mahdollisessa k&auml;yt&ouml;n aikaisessa virhetilanteessa asiakkaan
on reklamoitava kirjallisesti kahdeksan (8) p&auml;iv&auml;n kuluessa havaittuaan
virheen. Mik&auml;li reklamointia ei tehd&auml; t&auml;ss&auml; ajassa menett&auml;&auml; asiakas
oikeuden vahingonkorvaukseen tai sopimuksen purkuun. Vahingonkorvausta
on vaadittava yhden (1) kuukauden kuluessa virheen havaitsemisesta.</p>
<h2>8 Sopimuskausi sopimuksen p&auml;&auml;ttyminen</h2>
<p>8.1 Sopimuskaudesta sovitaan sopimuksessa tai tilausvahvistuksessa. Ellei
muuta ole sovittu,</p>
<p>a) on sopimus voimassa toistaiseksi voimassaolevana. Sopimus on irtisanottava
kirjallisesti yksi (1) kuukausi ennen laskutusjakson p&auml;&auml;ttymist&auml;.
Jos asiakas p&auml;&auml;tt&auml;&auml; sopimuksen, etuk&auml;teen maksettuja
maksuja ei palauteta.</p>
<p>b) m&auml;&auml;r&auml;aikainen sopimus jatkuu sovitun m&auml;&auml;r&auml;ajan
j&auml;lkeen kolmen (3) kuukauden sopimusjaksoissa, ellei sit&auml; kirjallisesti
irtisanota viimeist&auml;&auml;n yht&auml; (1) kuukautta ennen kunkin sopimusjakson
p&auml;&auml;ttymist&auml;.</p>
<p>8.2 Asiakkaalla on oikeus irtisanoa sopimus p&auml;&auml;ttym&auml;&auml;n
v&auml;litt&ouml;m&auml;sti, jos</p>
<p>a) palvelu olennaisesti poikkeaa sovitusta, eik&auml; Planeetta Internet
kohtuullisen ajan kuluessa asiakkaan ilmoituksesta uusi toimitusta; tai</p>
<p>b) jos palvelun toimitus kohtuuttomasti viiv&auml;styy Planeetta Internetin
tuottamuksesta johtuvasta syyst&auml;. Irtisanomisoikeus koskee ainoastaan
palvelun virheellist&auml; tai viiv&auml;stynytt&auml; osaa. Irtisanominen
on teht&auml;v&auml; kirjallisesti.</p>
<p>8.3 Planeetta Internetill&auml; on oikeus irtisanoa sopimus p&auml;&auml;ttym&auml;&auml;n
v&auml;litt&ouml;m&auml;sti joko kokonaan tai osittain,</p>
<p>a) jos asiakas rikkoo sopimusta olennaisesti eik&auml; korjaa rikkomusta
kohtuullisessa ajassa Planeetta Internetin ilmoituksesta;</p>
<p>b) asiakas ei ole maksanut er&auml;&auml;ntynytt&auml; maksua 14 p&auml;iv&auml;ss&auml; siit&auml;,
kun asiakasta on huomautettu t&auml;st&auml; kirjallisesti;</p>
<p>c) asiakas on konkurssissa, selvitystilassa tai on muutoin maksukyvyt&ouml;n</p>
<p>d) lisenssinantaja tai Planeetta Internetin p&auml;&auml;mies ei toimita
palvelua tai lisenssi&auml; taikka lopettaa palvelun tai lisenssin toimittamisen
Planeetta Internetille tai asiakkaalle; tai</p>
<p>e) palvelun k&auml;ytt&ouml; on ollut kokonaan keskeytettyn&auml; yli kahden
(2) kuukauden ajan kohdassa 14.2 mainitusta syyst&auml;</p>
<p>8.4 Planeetta Internetin tekem&auml; irtisanominen ei lakkauta asiakkaan
velvollisuutta maksaa maksut sopimuskauden loppuun asti, paitsi jos irtisanominen
johtuu ylivoimaisesta esteest&auml; tai yll&auml; kohdasta 8.3 d).</p>
<h2>9 Maksut ja Laskutus</h2>
<p>9.1 Asiakas maksaa Planeetta Internetille palvelusta ja sen k&auml;yt&ouml;st&auml; sopimuksessa
sovitut tai tilausvahvistuksessa m&auml;&auml;ritellyt maksut tai kulloinkin
voimassaolevan hinnaston mukaiset maksut. Asiakas on velvollinen maksamaan
arvonlis&auml;veron ja muut mahdolliset julkisoikeudelliset maksut.</p>
<p>9.2 Laskutus tapahtuu laskutuskausittain etuk&auml;teen. Ellei muuta ole
sovittu, on laskutuskausi kolme (3) kuukautta. Maksuehto on 14 p&auml;iv&auml;&auml; netto.
Viiv&auml;styskorko on EKP:n viitekorko + 7 % p.a.</p>
<p>9.3 Sopimuksen voimassa ollessa osapuolet voivat sopia palvelun kapasiteetin
nostamisesta ja t&auml;h&auml;n perustuvista uusista hinnoista.</p>
<p>9.4 Mik&auml;li asiakas haluaa laskea tilaamaansa kapasiteettia tai palvelutasoa;</p>
<p>a) on h&auml;n kuitenkin m&auml;&auml;r&auml;aikaisissa sopimuksissa velvollinen
maksamaan voimassaolevan sopimuksen tai tilauksen mukaista hintaa m&auml;&auml;r&auml;aikaisen
sopimuksen loppuun asti, tai</p>
<p>b) toistaiseksi voimassa olevissa sopimuksissa velvollinen maksamaan alkuper&auml;isen
sopimuksen tai tilauksen hintaa kuluvan laskutuskauden loppuun asti, kuitenkin
v&auml;hint&auml;&auml;n kolmen (3) kuukauden ajan.</p>
<p>9.5 Mik&auml;li Planeetta Internetin toimittamaan palveluun sis&auml;ltyy
kolmannen osapuolen Planeetta Internetin alihankkijana tai yhteisty&ouml;kumppanina
tuottamia palveluja, kuten lisensoituja palveluja, ja kyseinen kolmas osapuoli
muuttaa hinnoitteluaan, on Planeetta Internetill&auml; oikeus muuttaa hintaa
vastaavasti.</p>
<p>9.6 Jos palveluun liittyviss&auml; veroissa tai muissa viranomaisen m&auml;&auml;r&auml;&auml;miss&auml; julkisissa
maksuissa tapahtuu muutoksia, Planeetta Internetill&auml; on oikeus muuttaa
hintoja vastaavasti.</p>
<p>9.7 Planeetta Internetill&auml; on oikeus muuttaa laskutusjaksoittain veloitettavan
palvelun hintaa ilmoittamalla muutoksesta kirjallisesti v&auml;hint&auml;&auml;n
30 p&auml;iv&auml;&auml; ennen muutoksen voimaantuloa.</p>
<p>9.8 Jos Planeetta Internet on asiakkaan vaatimuksesta tehnyt ylit&ouml;it&auml; tai
tehnyt erityisj&auml;rjestely&auml; vaatineita t&ouml;it&auml;, Planeetta
Internetill&auml; on oikeus laskuttaa n&auml;ist&auml; aiheutuneet lis&auml;kustannukset.
Sopimukseen kuulumattomat palvelut ja ty&ouml;t veloitetaan voimassaolevan
hinnaston mukaisesti, ellei muuta ole sovittu.</p>
<p>9.9 Jos asiakas tekee laskusta Planeetta Internetille kirjallisen muistutuksen
ja maksaa laskun riidattoman osan, Planeetta Internet ei sulje palvelua riidanalaisen
osuuden maksamattomuuden vuoksi muistutuksen tutkimisen aikana.</p>
<h2>10 Varmuuskopiointi</h2>
<p>10.1 Asiakas vastaa palveluun tai palvelun avulla tallentamiensa tietojensa,
tiedostojensa ja dokumenttiensa varmuuskopioinnista ja niiden toimivuuden
tarkastamisesta, ellei toisin ole kirjallisesti sovittu. Planeetta Internet
ei vastaa tietojen, tiedostojen tai dokumenttien tuhoutumisen, katoamisen
tai muuttumisen aiheuttamista vahingoista eik&auml; niiden uudelleen luomisen
aiheuttamista kustannuksista.</p>
<p>10.2 Asiakkaan kanssa voidaan sopia sopimuksessa, tilausvahvistuksessa tai
palvelukuvauksessa tai muutoin kirjallisesti asiakkaan k&auml;yt&ouml;ss&auml; olevien
palvelimien, -j&auml;rjestelmien, ohjelmistojen ja tallennettujen tietojen
varmuuskopioinnista tietyin m&auml;&auml;r&auml;ajoin sek&auml; varmuuskopioiden
s&auml;ilytt&auml;misest&auml; ja palauttamisesta.</p>
<p>10.3 Ellei varmuuskopioinnista ole erikseen sovittu, ei Planeetta Internet
voi taata mahdollisessa virhetilanteessa j&auml;rjestelm&auml;n ja tiedostojen
palauttamisesta virhetilannetta edelt&auml;v&auml;&auml;n tasoon.</p>
<h2>11 Tietosuoja ja tietojen antaminen asiakkaan palveluista ja lokitiedostoista
viranomaisille</h2>
<p>11.1 Asiakas vastaa itse ja sitoutuu huolehtimaan riitt&auml;v&auml;st&auml; omien
tietokoneidensa ja muun tietoj&auml;rjestelm&auml;ns&auml;, tietoverkkojensa,
laitteiden, ohjelmistojen k&auml;ytt&auml;misen edellytysten suojauksesta.
T&auml;m&auml; sis&auml;lt&auml;&auml; muun muassa velvollisuuden k&auml;ytt&auml;&auml; ja
yll&auml;pit&auml;&auml; riitt&auml;v&auml;n tehokkaita viruksen torjuntaohjelmia
ja muita suojauskeinoja.</p>
<p>11.2 Palvelu voi mahdollistaa sen, ett&auml; asiakas voi ker&auml;t&auml; ja
tallentaa henkil&ouml;tietoja sek&auml; seurata s&auml;hk&ouml;ist&auml; viestiliikennett&auml; palvelussaan.
Asiakas sitoutuu k&auml;sittelem&auml;&auml;n n&auml;it&auml; tietoja vain
siin&auml; laajuudessa ja sellaiseen k&auml;ytt&ouml;tarkoitukseen, joka lain
nojalla on sallittua. Asiakkaan on noudatettava soveltuvia lakeja ja on niiden
noudattamisesta vastuussa.</p>
<p>11.3 Planeetta Internetill&auml; on oikeus poliisiviranomaisen tai lain
mukaan muuten toimivaltaisen viranomaisen tekem&auml;n pyynn&ouml;n perusteella
luovuttaa asiakkaan liittym&auml;&auml; tai p&auml;&auml;telaitteita koskevia
tunnistamis- ja liikennetietoja rikostutkinnallisiin tarkoituksiin siten kuin
siit&auml; on s&auml;&auml;detty s&auml;hk&ouml;isen viestinn&auml;n tietosuojalaissa
sek&auml; esitutkintaa, pakkokeinoja ja poliisin tai muun viranomaisen toimivaltuuksia
koskevassa lains&auml;&auml;d&auml;nn&ouml;ss&auml;.</p>
<h2>12 Palvelun kautta toimitettu aineisto.</h2>
<p>12.1 Asiakas vastaa palvelun kautta toisille k&auml;ytt&auml;jille taikka
Planeetta Internetin tai kolmansien osapuolten palvelimille toimitetusta aineistosta.
Erityisesti asiakas vastaa siit&auml;, ett&auml; asiakkaan Planeetta Internetin
palvelimella toimittama tai niill&auml; s&auml;ilytt&auml;m&auml; tai asiakkaan
palvelun kautta toimitettu:</p>
<p>a) aineisto ei aiheuta h&auml;iri&ouml;t&auml; televerkolle,</p>
<p>b) eik&auml; loukkaa kolmansien tekij&auml;noikeuksia, tavaramerkki&auml; tai
muita immateriaalioikeuksia,</p>
<p>c) palvelua ei k&auml;ytet&auml; laittomasti tekij&auml;noikeuksilla tai
muutoin suojattujen kuva- tai &auml;&auml;nitallenteiden, peli- tai tietokoneohjelmistojen
v&auml;litt&auml;miseen ja/tai ns. piraattituotteiden myyntiin (ml. ns. torrent-verkot
ja peer-to-peer verkot),</p>
<p>d) ei k&auml;ytet&auml; massapostituksiin (Spam) tai viestinverkkoja kohtaan
suunnattuihin ei-toivottuihin hy&ouml;kk&auml;yksiin, tai</p>
<p>e) ole lainvastaista tai vastoin viranomaisten m&auml;&auml;r&auml;yksi&auml; taikka
hyv&auml;&auml; tapaa.</p>
<p>12.2 Jos Planeetta Internet, viranomainen tai kolmas osapuoli osoittaa,
ett&auml; asiakkaan palvelun kautta on toimitettu t&auml;llaista aineistoa
toisille k&auml;ytt&auml;jille taikka Planeetta Internetin tai kolmannen palvelimille,
Planeetta Internetill&auml; on oikeus poistaa t&auml;llainen aineisto tai
est&auml;&auml; sen k&auml;ytt&ouml;.</p>
<p>12.3 Koska Planeetta Internet ei valvo palvelua hyv&auml;ksik&auml;ytt&auml;en
kolmansille toimitettua tai kolmansilta saatua aineistoa, Planeetta Internet
ei vastaa n&auml;iden aineistojen ja tietojen saatavuudesta taikka lainvastaisesta
tai loukkaavasta sis&auml;ll&ouml;st&auml;.</p>
<p>12.4 Planeetta Internet ei my&ouml;sk&auml;&auml;n vastaa palvelua hyv&auml;ksik&auml;ytt&auml;en
v&auml;litetyn aineiston mahdollisesta viiv&auml;stymisest&auml;, muuttumisesta
tai katoamisesta aiheutuvista vahingoista eik&auml; sis&auml;lt&ouml;&ouml;n
ja aineistoon liittyvist&auml; vaatimuksista ja riidoista ja niist&auml; mahdollisesti
aiheutuvista kustannuksista.</p>
<h2>13 Asiakkaan velvollisuudet</h2>
<p>13.1 Sen lis&auml;ksi mit&auml; muualla n&auml;iss&auml; ehdoissa ja erityisiss&auml; ehdoissa
on m&auml;&auml;ritelty tulee asiakkaan:</p>
<p>13.2 Asiakkaan on ilmoitettava viipym&auml;tt&auml; Planeetta Internetlle
laskutusosoitteensa muutoksesta. My&ouml;s nimen muutoksesta on ilmoitettava
heti. Ilmoitukset on teht&auml;v&auml; kirjallisesti.</p>
<p>13.3 Asiakas huolehtii siit&auml;, ett&auml; kopioi tai tulostaa j&auml;rjestelm&auml;st&auml; siihen
tallentamansa tiedon tarvitsemassaan laajuudessa ennen sopimuskauden p&auml;&auml;ttymist&auml;.
Sopimuskauden p&auml;&auml;tytty&auml; Planeetta Internet voi poistaa j&auml;rjestelm&auml;st&auml; asiakkaan
siihen tallentaman tiedon eik&auml; Planeetta Internetill&auml; ole sen j&auml;lkeen
velvollisuutta palauttaa asiakkaan j&auml;rjestelm&auml;&auml;n tallentamia
tietoja.</p>
<p>13.4 Sopimuksen p&auml;&auml;ttyess&auml; asiakkaan k&auml;yt&ouml;ss&auml; olleet
palveluun sis&auml;ltyneet laitteet normaali kuluminen huomioon ottaen ja
muu omaisuus sek&auml; aineisto, on palautettava Planeetta Internetille sellaisessa
kunnossa kuin ne asiakkaalle luovutettaessa olivat.</p>
<p>13.5 Asiakkaan on palautettava tai tuhottava kaikki k&auml;ytt&ouml;oikeuksin
luovutetut ohjelmistot ja ohjelmistokopiot sek&auml; poistettava tai muutoin
teht&auml;v&auml; k&auml;ytt&ouml;kelvottomaksi asiakkaan laitteisiin asennetut
ohjelmat ja k&auml;ytt&ouml;liittym&auml;t. Palvelun k&auml;ytt&ouml;&ouml;nottoon
liittyvi&auml; maksuja (kuten asennus-, avaus- tai liittymismaksut) ei palauteta.</p>
<h2>14 Palvelun sulkeminen</h2>
<h3>Asiakkaan oikeus pyyt&auml;&auml; palvelun sulkemista.</h3>
<p>14.1 Planeetta Internet sulkee palvelun asiakkaan pyynn&ouml;st&auml; m&auml;&auml;r&auml;ajaksi
tai toistaiseksi. Palvelun sulkemisesta ja uudelleen avaamisesta perit&auml;&auml;n
hinnaston mukainen maksu.</p>
<h3>Planeetta Internetin oikeus sulkea palvelu.</h3>
<p>14.2 Planeetta Internetill&auml; on oikeus sulkea tai keskeytt&auml;&auml; asiakkaan
palvelut joko osittain tai kokonaan, jos</p>
<p>a) asiakas ei maksukehotuksesta huolimatta ole suorittanut Planeetta Internetin
er&auml;&auml;ntynytt&auml; saatavaa 14 p&auml;iv&auml;n kuluessa maksukehotuksen
l&auml;hett&auml;misest&auml;,</p>
<p>b) asiakas ei toimita sopimuksen mukaista ennakkomaksua tai vakuutta viikon
kuluessa Planeetta Internetin vaatimuksesta,</p>
<p>c) asiakas on haettu selvitystilaan tai konkurssiin, asiakas on hakenut
julkista haastetta velkojilleen tai h&auml;net on muuten todettu maksukyvytt&ouml;m&auml;ksi
taikka asiakas on kaupparekisterimerkinn&auml;n tai muun sellaisen rekisterimerkinn&auml;n
mukaan lakannut olemasta,</p>
<p>d) asiakas on aiheuttanut h&auml;iri&ouml;t&auml; televerkolle, -liikenteelle
tai muille k&auml;ytt&auml;jille tai muistutuksesta huolimatta k&auml;ytt&auml;&auml; ep&auml;kuntoisia
laitteita tai ohjelmistoja,</p>
<p>e) asiakas on toimittanut tai asiakkaan palvelun kautta on toimitettu toisille
palvelun k&auml;ytt&auml;jille taikka Planeetta Internetin tai kolmannen palvelimille
kohdassa 12.1. tarkoitettua ei-toivottua aineistoa,</p>
<p>f) asiakas ei muistutuksesta huolimatta t&auml;yt&auml; sopimusvelvoitteitaan
tai rikkoo olennaisesti sopimuksen mukaisia velvoitteitaan, tai</p>
<p>g) tuomioistuin, teletoimintaa valvova viranomainen tai muu viranomainen
vaatii palvelun sulkemista tai sen keskeytt&auml;mist&auml;</p>
<p>14.3 Palvelun k&auml;yt&ouml;n keskeytt&auml;minen ei lakkauta k&auml;yt&ouml;n
m&auml;&auml;r&auml;st&auml; riippumattomien maksujen maksuvelvollisuutta.</p>
<p>14.4 Planeetta Internet voi peri&auml; k&auml;yt&ouml;n uudelleen avaamisesta
kulloinkin voimassaolevan hinnaston mukaisen maksun, mik&auml;li keskeytt&auml;minen
johtuu asiakkaasta.</p>
<h2>15 K&auml;ytt&auml;j&auml;tunnukset ja salasanat</h2>
<p>15.1 Planeetta Internet toimittaa asiakkaalle tilausvahvistuksen yhteydess&auml; k&auml;ytt&auml;j&auml;tunnukset
ja salasanat, numerot ja muut tunnukset palvelun k&auml;ytt&ouml;&auml; varten.
Asiakkaalla on sopimuksessa tai palvelukuvauksessa m&auml;&auml;ritellyt oikeudet
muuttaa palvelun sis&auml;lt&ouml;&auml; tai asetuksia k&auml;ytt&auml;j&auml;tunnuksia
hyv&auml;ksik&auml;ytt&auml;en.</p>
<p>15.2 Planeetta Internet varaa oikeuden muuttaa k&auml;ytt&auml;j&auml;tunnuksia
tai salasanoja, mik&auml;li viranomaisten m&auml;&auml;r&auml;ykset, palvelulliset
tai tekniset syyt sit&auml; edellytt&auml;v&auml;t. Planeetta Internet ilmoittaa
k&auml;ytt&auml;j&auml;tunnuksien muutoksista asiakkaalle kohtuullisessa ajassa
ennen muutosta</p>
<p>15.3 Asiakas voi pyyt&auml;&auml; Planeetta Interneti&auml; vaihtamaan salasanaa
tai k&auml;ytt&auml;j&auml;tunnusta. T&auml;st&auml; veloitetaan kulloinkin
voimassa olevan hinnaston mukainen toimenpidemaksu.</p>
<p>15.4 Asiakas saa luoda omia tunnuksia ja salasanoja, jos niin on palvelukuvauksessa
sallittu. Asiakas ei saa k&auml;ytt&auml;&auml; tunnuksia sopimuksen p&auml;&auml;tytty&auml;.</p>
<p>15.5 Asiakkaan on s&auml;ilytett&auml;v&auml; tunnuksia huolellisesti ja
siten, ett&auml; ne eiv&auml;t joudu ulkopuolisten k&auml;ytt&ouml;&ouml;n.
Asiakkaan on v&auml;litt&ouml;m&auml;sti ilmoitettava Planeetta Internetille
tunnusten paljastumisesta tai oletetusta paljastumisesta ulkopuolisille tai,
jos palvelua on muutoin k&auml;ytetty luvattomasti.</p>
<p>15.6 K&auml;ytt&auml;j&auml;tunnus on henkil&ouml;kohtainen ja asiakas vastaa
kaikesta sill&auml; tai sen avulla tehdyist&auml; muutoksista asiakkaan palveluihin
sek&auml; v&auml;&auml;rink&auml;yt&ouml;sten aiheuttamista tutkinta- ja/tai
korjauskuluista.</p>
<h2>16 Verkkotunnuksiin liittyv&auml;t oikeudet</h2>
<p>16.1 Asiakkaan tulee perehty&auml; verkkotunnusrekisterien erillisiin sopimusehtoihin
ja hyv&auml;ksy&auml; ne. Sopimusehdot ovat saatavilla kyseisten verkkotunnusrekisterien
Internet-sivustoilla.</p>
<p>16.2 Planeetta Internet rekister&ouml;i asiakkaan verkkotunnuksen kolmansien
osapuolien yll&auml;pit&auml;mien rekister&ouml;intipalvelujen kautta toimien
rekister&ouml;inniss&auml; asiakkaan maksun v&auml;litt&auml;j&auml;n&auml; ja
valtuutettuna.</p>
<p>16.3 Verkkotunnus rekister&ouml;id&auml;&auml;n pelk&auml;st&auml;&auml;n
asiakkaan antamien tietojen perusteella, joten asiakkaan tulee varmistua tietojen
oikeellisuudesta. Asiakas vastaa siit&auml;, ett&auml; h&auml;nell&auml; on
k&auml;ytt&ouml;oikeus rekister&ouml;it&auml;v&auml;&auml;n verkkotunnukseen.</p>
<p>16.4 Mik&auml;li rekister&ouml;inti&auml; haetaan verkkotunnuslain tai muiden
s&auml;&auml;d&ouml;sten vastaisesti, voi Viestint&auml;virasto tai muu rekister&ouml;intiviranomainen
hyl&auml;t&auml; tai perua rekister&ouml;innin verkkotunnuslain tai muun s&auml;&auml;nn&ouml;ksen
vastaisena, esim. seuraavin perustein:</p>
<p>a) tunnus on siirretty toiselle ilman tunnuksen haltijan tai suojatun nimen
tai merkin haltijan suostumusta, ja t&auml;m&auml; pyyt&auml;&auml; tunnuksen
peruuttamista;</p>
<p>b) on painavia perusteita ep&auml;ill&auml;, ett&auml; tunnus on suojattu
nimi tai merkki, ja nimen tai merkin haltija pyyt&auml;&auml; tunnuksen peruuttamista;</p>
<p>c) on painavia perusteita ep&auml;ill&auml;, ett&auml; tunnus on suojatun
nimen tai merkin johdannaisnimi tai -merkki ja se on hankittu ilmeisess&auml; hy&ouml;tymis-
tai vahingoittamistarkoituksessa, ja nimen tai merkin haltija pyyt&auml;&auml; tunnuksen
peruuttamista.</p>
<p>16.5 Mik&auml;li asiakas ei kahden viikon kuluessa pysty esitt&auml;m&auml;&auml;n
hyv&auml;ksytt&auml;v&auml;&auml; oikeutta rekister&ouml;innilleen, on mahdollista,
ett&auml; rekister&ouml;inti j&auml;&auml; toteutumatta tai se perutaan j&auml;lkik&auml;teen.
N&auml;iss&auml; tapauksissa Planeetta Internet ei hyvit&auml; asiakkaalle
t&auml;m&auml;n suorittamia rekister&ouml;inti- tai palvelumaksuja.</p>
<p>16.6 Mik&auml;li Planeetta Internet yll&auml;pit&auml;&auml; asiakkaan verkkotunnuksia
tai on rekister&ouml;inyt asiakkaan verkkotunnuksen, on Planeetta Internetill&auml; my&ouml;s
oikeus uusia verkkotunnus asiakkaan lukuun ja peri&auml; siit&auml; aiheutuvat
kustannukset asiakkaalta.</p>
<h2>17 IP-osoitteet</h2>
<p>17.1 Planeetta Internetin IP-palveluissa k&auml;ytett&auml;v&auml;t IP-osoitteet
ovat p&auml;&auml;s&auml;&auml;nt&ouml;isesti Planeetta Internetin omaisuutta
ja palaavat Planeetta Internetin hallintaan, kun palvelusopimus p&auml;&auml;ttyy.</p>
<p>17.2 Planeetta Internetill&auml; on oikeus teknisist&auml; syist&auml; johtuen
muuttaa asiakkaan k&auml;yt&ouml;ss&auml; olevia IP-osoitteita. N&auml;ist&auml; muutoksista
ilmoitetaan asiakkaalle yht&auml; (1) kuukautta ennen muutosta.</p>
<p>17.3 Joissakin Planeetta Internetin palveluissa jaetaan dynaamisia IP-osoitteita,
jotka vaihtuvat yhteyskertojen v&auml;lill&auml; tai yhteyden aikana. N&auml;m&auml; osoitteet
ovat Planeetta Internetin tarjoama yhteyden k&auml;ytt&auml;miseen tarvittava
palvelu. Asiakkaalla ei ole mit&auml;&auml;n muita kuin k&auml;ytt&ouml;aikaisia
oikeuksia kyseisiin IPosoitteisiin.</p>
<p>17.4 Asiakasta kiellet&auml;&auml;n aktiivisesti rekister&ouml;im&auml;st&auml; dynaamisesti
jaettuja IP-osoitteita mihink&auml;&auml;n palveluun, josta voi aiheutua toiselle
osoitetta k&auml;ytt&auml;v&auml;lle asiakkaalle ei-toivottuja tietoliikenneyhteyksi&auml;.</p>
<p>17.5 Mik&auml;li asiakas kiellosta huolimatta tekee kyseisen rekister&ouml;innin,
katsotaan h&auml;nen h&auml;irinneen tahallisesti tietoliikennett&auml; ja
h&auml;n on korvausvelvollinen aiheuttamastaan haitasta Planeetta Internetille
ja kolmansille osapuolille.</p>
<p>17.6 Joihinkin palveluihin asiakas voi kytkeyty&auml; olemassa olevilla
omilla IP-osoitteillaan tai hankkia omat osoitteet palveluaikana. Mik&auml;li
asiakkaan hankkima palvelu mahdollistaa n&auml;iden osoitteiden k&auml;yt&ouml;n,
on t&auml;st&auml; erikseen sovittu kyseisen palvelun palvelukohtaisissa ehdoissa.</p>
<h2>18 Immateriaalioikeudet</h2>
<p>18.1 Kaikki palveluihin, ohjelmistoihin, aineistoihin sek&auml; palvelun
suorittamiseen liittyv&auml;&auml;n ty&ouml;h&ouml;n ja sen perusteella syntyneisiin
aineistoihin liittyv&auml;t immateriaalioikeudet kuuluvat Planeetta Internetille,
Planeetta Internetin alihankkijoille tai Planeetta Internetille palvelun tai
ohjelmiston lisensoineelle kolmannelle osapuolelle, eik&auml; niit&auml; milt&auml;&auml;n
osin siirret&auml; asiakkaalle.</p>
<p>18.2 Asiakkaalla ole ilman Planeetta Internetin etuk&auml;teen antamaa kirjallista
suostumusta oikeutta kopioida, k&auml;&auml;nt&auml;&auml; tai muuttaa aineistoa,
asiakirjoja tai ohjelmistoja taikka luovuttaa niit&auml; kolmannen k&auml;ytt&ouml;&ouml;n,
ellei pakottavasta lains&auml;&auml;d&auml;nn&ouml;st&auml; muuta johdu. Asiakas
ei saa poistaa, muokata tai peitt&auml;&auml; palvelussa olevia tekij&auml;noikeus-,
tavaramerkki- tai muita immateriaalioikeusmerkint&ouml;j&auml;.</p>
<p>18.3 Silt&auml; osin kuin Planeetta Internet tuottaa palvelun itse Planeetta
Internet vastaa siit&auml;, ett&auml; palvelu ei yksist&auml;&auml;n loukkaa
sopimuksen solmimishetkell&auml; palvelun Suomessa voimassaolevia immateriaalioikeuksia.
Kolmannen osapuolen, ml. lisensioijien, valmistamissa tai tuottamissa palveluissa
ja ohjelmistoissa noudatetaan ko. kolmannen osapuolen k&auml;ytt&ouml;oikeus-,
lisenssitai palveluehtoja ja n&auml;iss&auml; m&auml;&auml;riteltyj&auml; immateriaalioikeuksia.</p>
<p>18.4 Mik&auml;li asiakasta vastaan nostetaan kanne tai esitet&auml;&auml;n
vaatimuksia sill&auml; perusteella, ett&auml; Planeetta Internetin itse tuottaman
palvelun k&auml;ytt&auml;minen loukkaa suojattua tekij&auml;noikeutta, huolehtii
Planeetta Internet parhaaksi katsomallaan tavalla asiakkaan puolustuksesta
ja korvaa asiakkaan maksettavaksi tuomitut korvaukset.</p>
<p>18.5 Planeetta Internetin vastuu edellytt&auml;&auml;, ett&auml; asiakas
ilmoittaa vaatimuksista kirjallisesti v&auml;litt&ouml;m&auml;sti niist&auml; tiedon
saatuaan ja samalla antaa valtuutuksen Planeetta Internetille asiakkaan eduista
huolehtimiseksi sek&auml; antaa Planeetta Internetille tarpeellisen tiedon
ja avun.</p>
<p>18.6 Jos Planeetta Internet katson edell&auml; mainittu immateriaaliloukkauksen
olevan todenn&auml;k&ouml;inen, Planeetta Internet harkintansa mukaan hankkii
omalla kustannuksellaan oikeuden palvelun tai sen osan k&auml;yt&ouml;n jatkamiseen,
korvaa palvelun vastaavalla tuotteella tai muuttaa palvelua siten, ettei loukkausta
en&auml;&auml; tapahdu. Planeetta Internet voi my&ouml;s t&auml;ll&ouml;in
irtisanoa palveluntuottamisen v&auml;litt&ouml;m&auml;sti.</p>
<p>18.7 Planeetta Internet ei vastaa immateriaalioikeuksien loukkauksista silt&auml; osin
kuin ne koskevat muuta kuin Planeetta Internetin tuottamaa palvelua tai ohjelmistoa.
Planeetta Internet ei my&ouml;sk&auml;&auml;n vastaa immateriaalioikeuksien
loukkauksista, jotka aiheutuvat asiakkaan palveluun tekem&auml;st&auml; muutoksesta,
sopimuksen vastaisesta k&auml;ytt&ouml;tarkoituksesta tai siit&auml;, ett&auml; palvelua
k&auml;ytet&auml;&auml;n yhdess&auml; toisen toimittajan toimittaman tai asiakkaan
tuottaman palvelun kanssa tai vastoin Planeetta Internetin antamia ohjeita.</p>
<p>18.8 Planeetta Internetin vastuu immateriaalioikeuksien loukkauksen osalta
rajoittuu t&auml;m&auml;n kohdan 18 mukaisiin toimenpiteisiin. Asiakas vastaa
siit&auml;, ett&auml; asiakkaan Planeetta Internetin k&auml;ytt&ouml;&ouml;n
luovuttaman ohjelmiston tai aineiston k&auml;ytt&ouml; ei loukkaa kolmannen
osapuolen immateriaalioikeuksia. Asiakkaan tulee hankkia tarvittavat oikeudet
ja korvata Planeetta Internetille kaikki immateriaaliloukkauksesta aiheutuneet
vahingot.</p>
<h2>19 K&auml;ytt&ouml;oikeus ohjelmistoihin ja dokumentteihin.</h2>
<p>19.1 Planeetta Internet my&ouml;nt&auml;&auml; asiakkaalle k&auml;ytt&ouml;oikeuden
Planeetta Internetin sopimuksen perusteella toimittamien ohjelmistojen konekielisiin
versioihin ja asiakirjoihin sek&auml; palvelun testaamiseksi toimitettuun
aineistoon ja tietoihin.</p>
<p>19.2 K&auml;ytt&ouml;oikeuden perusteella asiakas saa k&auml;ytt&auml;&auml; ohjelmistoja
ja asiakirjoja sek&auml; testausaineistoa ja -tietoja ainoastaan Planeetta
Internetin ohjeiden mukaan ja vain v&auml;litt&ouml;m&auml;sti palvelun k&auml;ytt&ouml;&ouml;n
tai sen testaukseen liittyen.</p>
<p>19.3 K&auml;ytt&ouml;oikeuden p&auml;&auml;ttyess&auml; asiakkaan on omalla
kustannuksellaan joko palautettava tai Planeetta Internetin pyynn&ouml;st&auml; tuhottava
hallussaan olevat alkuper&auml;is- ja j&auml;ljenn&ouml;skopiot, tietov&auml;lineet
ja dokumentaatio</p>
<h2>20 Vastuunrajaus ja vahingonkorvaus</h2>
<p>20.1 Palvelun virheest&auml; johtuva Planeetta Internetin vastuu rajoittuu
sen vastuulla olevan virheellisen palvelun korjaamiseen tai vaihtoehtoisesti
virheellisesti suoritetun palvelun uudelleen suorittamiseen.</p>
<p>20.2 Miss&auml;&auml;n tilanteessa Planeetta Internet ei ole velvollinen
korvaamaan v&auml;lillisi&auml; tai ep&auml;suoria vahinkoja, kuten tuoton
tai hy&ouml;dyn menetyst&auml;, liikevaihdon tai tuotannon v&auml;henemist&auml;,
tiedon katoamista tai viiv&auml;stymist&auml;, tai muuta v&auml;lillist&auml; vahinkoa.</p>
<p>20.3 Virhe- ja viiv&auml;stystilanteissa Planeetta Internet on velvollinen
korvaamaan asiakkaalle vain sen tahallisesti tai tuottamuksella aiheutetut,
asiakkaan osoittamat v&auml;litt&ouml;m&auml;t vahingot.</p>
<p>a) Mik&auml;li kyseess&auml; on laskutusjaksoissa laskutettava palvelu,
Planeetta Internet vahingonkorvausvelvollisuuden enimm&auml;ism&auml;&auml;r&auml; on
kyseisen palvelun osalta sen laskennallinen kuukausihinta rikkomushetkell&auml; kerrottuna
(2) kahdella.</p>
<p>b) Kertaluontoisten toimitusten osalta Planeetta Internetin vahingonkorvausvelvollisuuden
enimm&auml;is-m&auml;&auml;r&auml; on viisitoista (15) prosenttia niiden palvelujen
hinnasta, jonka toimituksesta on kysymys tai jos korvaus ei ole kohdistettavissa
tiettyyn palveluun, korvausvelvollisuus on enint&auml;&auml;n viisitoista
(15) prosenttia sopimuksen kokonaishinnasta</p>
<p>20.4 Vahingonkorvausta on vaadittava Planeetta Internetilt&auml; kuukauden
kuluessa siit&auml;, kun korvauksen perusteena oleva virhe havaittiin tai
se olisi pit&auml;nyt havaita tai kuukauden kuluessa toimituksen tapahtumisesta.</p>
<h2>21 Kuluttaja-asiakkaiden lains&auml;&auml;d&auml;nt&ouml;&ouml;n perustuvat
oikeudet</h2>
<p>N&auml;m&auml; sopimusehdot eiv&auml;t rajoita kuluttaja-asiakkaan kuluttajalains&auml;&auml;d&auml;nn&ouml;n
tai muun pakottavan lains&auml;&auml;d&auml;nn&ouml;n mukaisia oikeuksia.
Mik&auml;li n&auml;m&auml; sopimusehdot tai palveluiden erityiset ehdot ja
kuluttaja-asiakkaan lains&auml;&auml;d&auml;nn&ouml;n mukaiset oikeudet ovat
ristiriidassa kesken&auml;&auml;n, sopimusehtoja tulkitaan kuluttajan edun
ja kuluttajalains&auml;&auml;d&auml;nn&ouml;n mukaisesti.</p>
<h2>22 Sopimuksen p&auml;&auml;ttyminen</h2>
<h3>Sopimuksen irtisanominen</h3>
<p>22.1 Sopimuksen irtisanomisesta voidaan sopia sopimuksessa ta tilausvahvistuksessa
Mik&auml;li n&auml;iss&auml; ei ole m&auml;&auml;r&auml;yksi&auml; tai ehtoja
sopimuksen irtisanomiseen sovelletaan irtisanomiseen mit&auml; n&auml;iden
ehtojen kohdassa 8 on m&auml;&auml;r&auml;tty.</p>
<h3>Sopimuksen purkaminen</h3>
<p>22.2 Asiakkaalla on oikeus purkaa sopimus, jos palvelu poikkeaa olennaisesti
sovitusta, eik&auml; Planeetta Internet korjaa puutetta tai uusi toimitusta
kohtuullisessa ajassa asiakkaan kirjallisesta huomautuksesta, taikka jos palvelun
toimitus viiv&auml;styy kohtuuttomasti Planeetta Internetin tuottamuksesta
johtuvasta syyst&auml;. Asiakkaan purkuoikeus koskee ainoastaan palvelun virheellist&auml; tai
viiv&auml;stynytt&auml; osaa.</p>
<p>22.3 Planeetta Internet voi purkaa palvelusopimuksen kokonaan tai osittain,
jos</p>
<p>a) palvelu on ollut suljettuna asiakkaan pyynn&ouml;st&auml; yli kaksi (2)
kuukautta,</p>
<p>b) palvelu on ollut suljettuna kohdassa 14.2 mainitusta syyst&auml; kaksi
(2) kuukautta tai</p>
<p>c) asiakas on olennaisesti rikkonut sopimusvelvoitteitaan, eik&auml; korjaa
rikkomustaan nelj&auml;ss&auml;toista (14) vuorokaudessa Planeetta Internetin
kirjallisesta vaatimuksesta.</p>
<h3>Purku- ja irtisanomisilmoitukset</h3>
<p>22.4 Purku- ja irtisanomisilmoitukset on teht&auml;v&auml; kirjallisesti</p>
<h2>23 Salassapitovelvollisuus</h2>
<p>23.1 Osapuoli sitoutuu pit&auml;m&auml;&auml;n luottamuksellisena toiselta
osapuolelta saamansa luottamukselliset aineistot ja tiedot. Planeetta
Internet pid&auml;tt&auml;&auml; kaikki oikeudet luovutettuihin aineistoihin
ja tietoihin, eik&auml; asiakkaalla ole oikeutta ilman erillist&auml; kirjallista
sopimusta niiden hy&ouml;dynt&auml;miseen muutoin kuin v&auml;litt&ouml;m&auml;sti
sopimuksen mukaisen toiminnan yhteydess&auml;.</p>
<p>23.2 Sopimuksen p&auml;&auml;ttyess&auml; osapuolen on palautettava toiselta
osapuolelta saamansa tiedot ja aineisto sek&auml; h&auml;vitett&auml;v&auml; hallussaan
oleva aineisto ja kopiot. Kumpikin osapuoli vastaa osaltaan siit&auml;, ett&auml; sen
palveluksessa olevat ty&ouml;ntekij&auml;t sek&auml; osapuolen mahdollisesti
k&auml;ytt&auml;m&auml;t alihankkijat sitoutuvat edell&auml; mainittuihin
salassapitos&auml;&auml;nn&ouml;ksiin. T&auml;m&auml; salassapitoehto on voimassa
my&ouml;s sopimuksen p&auml;&auml;ttymisen j&auml;lkeen.</p>
<h2>24 Ilmoitukset</h2>
<p>24.1 Asiakkaan tulee l&auml;hett&auml;&auml; t&auml;h&auml;n sopimukseen
liittyv&auml;t ilmoitukset kirjallisesti Planeetta Internetin sopimuksessa
mainittuun tai my&ouml;hemmin ilmoitettuun osoitteeseen, telefaksinumeroon
tai s&auml;hk&ouml;postiosoitteeseen.</p>
<p>24.2 Planeetta Internetin tulee l&auml;hett&auml;&auml; t&auml;t&auml; sopimusta
koskevat kirjalliset ilmoitukset asiakkaan viimeksi ilmoittamaan laskutusosoitteeseen
taikka asiakkaan Planeetta Internetille ilmoittamaan telefaksinumeroon tai
s&auml;hk&ouml;postiosoitteeseen.</p>
<h2>25 Force Majeure ja vapauttamisperusteet</h2>
<p>25.1 Sopijapuoli vapautuu velvoitteistaan ja velvollisuudestaan maksaa vahingonkorvausta,
jos sopimusvelvoitteiden rikkominen tai niiden t&auml;ytt&auml;m&auml;tt&auml; j&auml;tt&auml;minen
johtuu vapauttamisperusteista. Vapauttamisperusteeksi (force majeure) katsotaan
sellainen sopimuksen syntymisen j&auml;lkeen sattunut ep&auml;tavallinen ja
asiaan vaikuttava tapahtuma, jota sopimuspuolen ei ole syyt&auml; ottaa huomioon
sopimusta teht&auml;ess&auml; ja joka on sopimuspuolista riippumaton, tai
jonka vaikutusta ei voida kohtuudella v&auml;ltt&auml;&auml; tai voittaa.
T&auml;llainen tapahtuma voi olla esim. sota, kapina, valuuttarajoitukset,
lains&auml;&auml;nn&ouml;kset ja viranomaism&auml;&auml;r&auml;ykset, vientilisenssin
ep&auml;&auml;minen, pakko-otto tai takavarikko, tuonti- tai vientikielto,
luonnonmullistus, vakava epidemia, yleisen liikenteen, tietoliikenteen tai
energiajakelun keskeytys, k&auml;ytt&ouml;voiman rajoitukset, ty&ouml;selkkaus,
tulipalo,tai</p>
<p>kolmannelta osapuolelta hankittujen tai kolmannen osapuolen hallussa olevien
teleyhteyksien tai laitteiden viallisuus tai viiv&auml;styminen, kolmannen
osapuolen aiheuttama kaapelivaurio taikka muu vaikutuksiltaan vastaava ja
ep&auml;tavallinen sopijapuolista riippumaton syy sek&auml; edell&auml; t&auml;ss&auml; kohdassa
mainituista seikoista johtuvat alihankkijan toimituksissa olevat virheet taikka
viiv&auml;stykset.</p>
<p>25.2 Jos sopimusvelvoitteen t&auml;ytt&auml;minen viiv&auml;styy jostakin
edellisess&auml; kappaleessa mainitusta syyst&auml;, sopimusvelvoitteen t&auml;ytt&auml;misaikaa
jatketaan niin paljon kuin kaikki tapaukseen vaikuttavat olosuhteet huomioonottaen
on pidett&auml;v&auml; kohtuullisena.</p>
<h2>26 Sopimusehtojen muuttaminen ja toimittaminen</h2>
<p>26.1 Planeetta Internet voi muuttaa n&auml;it&auml; Yleisi&auml; Sopimusehtoja
ja/tai Palveluita koskevia Erityisi&auml; Sopimusehtoja. Asiakkaalle tiedotetaan
uusista sopimusehdoista v&auml;hint&auml;&auml;n kuukautta ennen niiden voimaantuloa
asiakastiedottein tai muutoin kirjallisesti ja Planeetta Internetin asiakassivustolla.</p>
<p>26.2 Tiedottaminen tapahtuu kirjallisesti siihen osoitteeseen, jonka asiakas
on ilmoittanut laskutustaan varten edellisen laskutusjakson alussa tai muutoin
sovitulla tavalla. T&auml;ss&auml; kohdassa mainitut ehdot voivat muuttua
my&ouml;s lain, asetuksen tai viranomaisp&auml;&auml;t&ouml;ksen johdosta.</p>
<p>26.3 Asiakkaalla on oikeus irtisanoa toistaiseksi voimassa oleva sopimus
p&auml;&auml;ttyv&auml;ksi muutoksen voimaantullessa, jos Planeetta Internet
ilmoittaa muuttavansa sopimusehtoja, kuitenkin aikaisintaan seuraavan laskutuskauden
p&auml;&auml;ttyess&auml;.</p>
<p>26.4 N&auml;m&auml; Sopimusehdot ja erityiset sopimusehdot ovat saatavilla
Planeetta Internetin asiakkaiden k&auml;ytt&ouml;&ouml;n tarkoitetuilta palvelusivuilta,
joihin asiakas p&auml;&auml;see omilla k&auml;ytt&auml;j&auml;tunnuksillaan.
Planeetta Internet toimittaa asiakkaan pyynn&ouml;st&auml; toimitusehdot maksutta
asiakkaalle postitse tai s&auml;hk&ouml;postitse.</p>
<h2>27 Riitojen ratkaisu ja sovellettava laki</h2>
<p>27.1 T&auml;h&auml;n sopimukseen sovelletaan Suomen lakia.</p>
<p>27.2 Sopimuksen soveltamista ja tulkintaa koskevat erimielisyydet tulee
ensisijaisesti ratkaista osapuolten v&auml;lisin neuvotteluin. Sopimuksista
aiheutuvat riidat, joista ei p&auml;&auml;st&auml; yksimielisyyteen neuvottelemalla,
ratkaistaan Helsingin k&auml;r&auml;j&auml;oikeudessa.</p>
<p>27.3 Kuluttaja-asiakas voi kuitenkin nostaa kanteen my&ouml;s sen paikkakunnan
alioikeudessa, jonka tuomiopiiriss&auml; h&auml;nell&auml; on kotipaikka.
Kuluttaja-asiakkaalla on lis&auml;ksi oikeus saattaa asia kuluttajavalituslautakunnan
ratkaistavaksi.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h1><a id="tietosuojaehdot"></a>Planeetta Internet Oy - Liite yleisiin sopimusehtoihin: tietosuojaehdot 05/2018		</h1>
<p> Tämä sopimusliite on olennainen ja erottamaton osa Planeetta Internet Oy:n (jäljempänä “Planeetta Internet”) yleisiä sopimusehtoja. Tätä liitettä ja näitä tietosuojaehtoja sovelletaan siinä tilanteessa ja siltä osin, kun Planeetta Internet toimii suhteessa asiakkaaseensa EU:n tietosuoja-asetuksen (2016/679) tarkoittamana henkilötietojen käsittelijänä ja asiakas on rekisterinpitäjänä ulkoistanut henkilötietojensa käsittelyä joltain osin Planeetta Internetille. Mikäli Planeetta Internetin yleisten ehtojen ja näiden ehtojen välillä on ristiriitaa, saa yleiset ehdot etusijan.		</p>
<h2>Määritelmät</h2>
<p> Tässä liitteessä käytetyt käsitteet saavat sen merkityssisällön, joka niille on annettu Euroopan Unionin asetuksessa 2016/679 luonnollisten henkilöiden suojelusta henkilö tietojen käsittelyssä sekä näiden tietojen vapaasta liikkuvuudesta ja direktiivin 95/46/EY kumoamisesta (jäljempänä “tietosuoja-asetus”). Tällaisia käsitteitä ovat erityisesti termit rekisterinpitäjä, henkilötietojen käsittelijä, henkilötieto, rekisteröity, käsittely ja henkilötietojen tietoturvaloukkaus. </p>
<h2>Tarkoitus</h2>
<p> Planeetta Internet on hosting-palveluiden tarjoamista harjoittava yritys. Asiakas on yritys, elinkeinonharjoittaja tai muu organisaatio, joka tarvitsee ja hankkii verkkosivustolleen hosting-palveluja Planeetta Internetiltä. Tällä liitteellä osapuolet sopivat siitä, että Planeetta Internet henkilötietojen käsittelijänä käsittelee sopimuksen voimassaoloaikana henkilötietoja asiakkaan, rekisterinpitäjän, lukuun.</p>
<p> Henkilötietojen käsittelijä käsittelee henkilötietoja ainoastaan hosting-palveluiden sekä mahdollisesti muiden sopimuksessa kuvattujen velvoitteiden täyttämiseksi sekä palveluiden tarjoamiseksi ja toimittamiseksi asiakkaalle  tämän antamien kirjallisten ohjeiden mukaisesti.</p>
<p> Henkilötietojen käsittelijällä ei ole oikeutta käsitellä henkilötietoja mihinkään muuhun tarkoitukseen tai kenenkään muun hyväksi. Henkilötietojen käsittelijällä on oikeus siirtää henkilötietoja EU:n tai ETA:n ulkopuolisiin maihin, edellyttäen että siirto tapahtuu tietosuoja-asetuksessa määriteltyä riittäviä suojamekanismeja käyttäen. Henkilötietojen käsittelijän on välittömästi ilmoitettava rekisterinpitäjälle, jos tämä katsoo, että rekisterinpitäjän antamat käsittelyä koskevat kirjalliset ohjeistukset rikkovat tietosuoja-asetusta tai muita unionin tai jäsenvaltion tietosuojasäännöksiä. Tämän liitteen ehtojen lisäksi kumpikin osapuoli sitoutuu noudattamaan sovellettavia kansallisia tietosuojalakeja ja tietosuoja-asetuksen säännöksiä toimintaansa soveltuvin osin.</p>
<p> Käsittelyä koskevat tarkemmat tiedot, kuten käsittelyn luonne, henkilötietojen tyyppi ja rekisteröityjen ryhmät, on kuvattu jäljempänä. </p>
<h2>Alihankinnat</h2>
<p> Henkilötietojen käsittelijällä on oikeus käyttää käsittelyssä toisen henkilötietojen käsittelijän palveluja edellyttäen, että henkilötietojen käsittelijä ilmoittaa tästä kirjallisesti vähintään 7 päivää etukäteen rekisterinpitäjälle. Kirjallisten ilmoitusten toimittamisvelvollisuus koskee suunniteltua käsittelijän lisäämistä, poistamista tai vaihtamista. Ilmoituksen saatuaan rekisterinpitäjä voi vastustaa suunniteltuja muutoksia.</p>
<p> Käyttäessään toisen henkilötietojen käsittelijän palveluja, henkilötietojen käsittelijän tulee sopia palveluntarjoajan kanssa, että käsittely tapahtuu noudattaen samoja tietosuojavelvoitteita, kuin mitä tässä liitteessä on kuvattuna. Henkilötietojen käsittelijä vastaa siitä, että sen käyttämän toisen henkilötietojen käsittelijän palvelut toteutetaan tämän liitteen vaatimusten mukaisina.  </p>
<h2>Salassapito</h2>
<p> Kaikkia henkilötietoja joita henkilötietojen käsittelijä käsittelee rekisterinpitäjän lukuun pidetään rekisterinpitäjän luottamuksellisina tietoina ja henkilötietojen käsittelijä sitoutuu pitämään tiedot salassa ja olemaan luovuttamatta tai paljastamatta niitä kenellekään kolmannelle osapuolelle tai käyttämättä tietoja muuhun kuin sovittuun tarkoitukseen. Henkilötietojen käsittelijä sitoutuu myös olemaan luovuttamatta ja paljastamatta henkilötietoja omassa organisaatiossaan muille kuin sellaisille työntekijöilleen tai muille henkilöille (ml. mahdolliset alihankkijat), joiden on tarpeen tuntea kyseinen tieto sovittua tarkoitusta varten ja jotka ovat palvelu- tai muiden sopimustensa perusteella taikka lakisääteisesti velvollisia pitämään tiedon luottamuksellisena. Salassapitovelvoitteet pysyvät voimassa sopimuksen päättymisestä huolimatta. </p>
<h2>Tietoturva </h2>
<p>Henkilötietojen käsittelijän tulee huolehtia, että se toteuttaa kaikki asianmukaiset tekniset ja organisatoriset toimenpiteet, joilla pyritään estämään henkilötietojen vahingossa tapahtuva tai lainvastainen tuhoaminen, häviäminen, muuttaminen, luvaton luovuttaminen taikka pääsy tietoihin. </p>
<p>Toimenpiteet tulee suunnitella huomioiden uusin tekniikka ja toteuttamiskustannukset, käsittelyn luonne, laajuus, asiayhteys ja tarkoitukset sekä luonnollisten henkilöiden oikeuksiin ja vapauksiin kohdistuvat, todennäköisyydeltään ja vakavuudeltaan vaihtelevat riskit, kuten </p>
<p>a) henkilötietojen pseudonymisointi ja salaus;</p>
<p>b) kyky taata käsittelyjärjestelmien ja palveluiden jatkuva luottamuksellisuus, eheys, käytettävyys ja vikasietoisuus;</p>
<p>c) kyky palauttaa nopeasti tietojen saatavuus ja pääsy tietoihin fyysisen tai teknisen vian sattuessa;</p>
<p>d) menettely, jolla testataan, tutkitaan ja arvioidaan säännöllisesti teknisten ja organisatoristen toimenpiteiden tehokkuutta tietojenkäsittelyn turvallisuuden varmistamiseksi.		</p>
<h2>Henkilötietojen tietoturvaloukkaukset		</h2>
<p>Henkilötietojen käsittelijän on ilmoitettava tietoonsa tulleesta käsittelyssä tapahtuneesta henkilötietojen tietoturvaloukkauksesta rekisterinpitäjälle ilman aiheetonta viivytystä, jotta rekisterinpitäjä voi täyttää tietosuoja-asetuksessa määritellyt ilmoitusvelvoitteet asetetussa määräajassa. Tietoturvaloukkauksesta tulee antaa riittävät tiedot ja henkilötietojen käsittelijän tulee muutoinkin avustaa rekisterinpitäjää, jotta rekisterinpitäjä voi täyttää tälle tietosuoja-asetuksessa asetetut velvoitteet. Henkilötietojen käsittelijän tulee myös ryhtyä tarpeellisiin jatkotoimenpiteisiin, joilla henkilötietojen tietoturvaloukkauksen haittavaikutuksia voidaan lieventää tai tulevia loukkauksia estää. </p>
<h2>Tietosuojaa koskeva vaikutustenarviointi </h2>
<p>Mikäli henkilötietojen käsittelijä tulee tietoiseksi siitä, että suunniteltu käsittely aiheuttaisi korkean riskin luonnollisen henkilön oikeuksien ja vapauksien kannalta, tulee sen ilmoittaa tästä rekisterinpitäjälle ja avustaa tätä tarvittaessa tietosuojaa koskevan vaikutustenarvioinnin toteuttamisessa.</p>
<p> </p>
<h2>Rekisteröidyn oikeuksien toteuttaminen</h2>
<p> Ottaen huomioon käsittelytoimen luonteen, henkilötietojen käsittelijän tulee kohtuudella ja ilman aiheetonta viivästystä auttaa rekisterinpitäjää asianmukaisilla teknisillä ja organisatorisilla toimenpiteillä mahdollisuuksien mukaan täyttämään rekisterinpitäjän velvollisuuden vastata pyyntöihin, jotka koskevat tietosuoja-asetuksessa säädettyjen rekisteröidyn oikeuksien käyttämistä. Tällaisia oikeuksia voivat olla muun muassa, sellaisina kuin ne on tietosuoja-asetuksessa määritelty, rekisteröidyn oikeus saada pääsy tietoon, oikeus saada tieto korjatuksi, oikeus kieltää käsittely, oikeus tietojen poistamiseen (ns. “oikeus tulla unohdetuksi”), oikeus käsittelyn rajoittamiseen ja oikeus saada tiedot siirretyksi järjestelmästä toiseen. Mikäli tällaisia vaatimuksia esitetään suoraan henkilötietojen käsittelijälle, sen tulee viipymättä ilmoittaa niistä rekisterinpitäjälle. </p>
<h2>Auditoinnit</h2>
<p>Henkilötietojen käsittelijän tulee saattaa rekisterinpitäjän saataville kaikki tiedot, jotka ovat tarpeen tietosuoja-asetuksessa säädettyjen velvollisuuksien noudattamisen osoittamista varten, ja henkilötietojen käsittelijä sallii ja kohtuudella avustaa rekisterinpitäjän tai muun rekisterinpitäjän valtuuttaman auditoijan suorittamat auditoinnit, kuten tarkastukset henkilötietojen käsittelijän tiloihin, järjestelmiin, prosesseihin ja dokumentaatioon, sekä osallistuu itse niihin, mikäli rekisterinpitäjä katsoo tarpeelliseksi sellaisen toteuttamisen. Auditoinnit tulee suorittaa normaalin työajan puitteissa siten, että niistä aiheutuisi mahdollisimman vähän haittaa henkilötietojen käsittelijän liiketoiminnalle. Kumpikin osapuoli vastaa omista auditoinnin suorittamiseen liittyvistä kustannuksistaan. Rekisterinpitäjän tulee ilmoittaa henkilötietojen käsittelijälle vähintään 45 päivää etukäteen auditoinnin toteuttamisesta.		</p>
<h2>Asiakkaan avustamisvelvollisuus		</h2>
<p>Sopimuksen voimassaoloaikana asiakas voi kirjallisesti pyytää, että Planeetta Internet avustaa häntä tietosuojalainsäädännön rekisterinpitäjää koskevien velvoitteiden täyttämisessä. Tämä edellyttää, että kyseiset velvoitteet liittyvät asiakkaan Planeetta Internetiltä hankittuihin palveluihin ja kyseiset velvoitteet ovat sellaisia, joiden osalta Planeetta Internetillä on velvollisuus avustaa rekisterinpitäjää. Tämä koskee erityisesti avustamista tietosuojaloukkaustilaanteissa, rekisteröidyn oikeuksien täyttämisessä sekä tietosuojavaikutusten arviointien toteuttamisessa. Planeetan avustaessa asiakasta kaikista kustannuksista  vastaa asiakas. Ellei muusta ole sovittu, on Planeetta Internet oikeutettu laskuttamaan avustamiseen käyttämänsä työaika aikaperusteisella veloituksella kulloinkin voimassa olevan hinnaston mukaisesti.		</p>
<h2>Asiakkaan velvollisuudet</h2>
<p>Asiakas toimii rekisterinpitäjänä suhteessa näiden tietosuojaehtojen perusteella käsiteltäviin henkilötietoihin ja asiakas vastaa siitä, että se täyttää kaikki ne velvollisuudet, joita lainsäädäntö edellyttää rekisterinpitäjältä (mm. rekisteröityjen informoiminen, tietosuojaselosteiden laatiminen ja saatavilla pitäminen, riittävien ja lainmukaisten käsittelyperusteiden varmistaminen, mukaan lukien suostumusten hankkiminen, mikäli käsittely suostumusta edellyttää). Asiakas vastaa myös siitä, että tämän Planeetta Internetille antamat käsittelyohjeet ovat lainmukaisia.</p>
<p>Asiakas on velvollinen ilmoittamaan Planeetta Internetille kaikista sellaisista seikoista (mukaan lukien erityiset riskit tai henkilötietoryhmät), jotka saattavat edellyttää ylimääräisten teknillisten tai organisatoristen suojaustoimenpiteiden määrittelemisestä ja sopimista. </p>
<p>Asiakas yksin määrittelee ja vastaa palveluihin tallennetuista tiedoista (mukaan lukien henkilötiedoista) ja siitä, että tällä on oikeus käsitellä ja tallentaa palveluun henkilötietoja ja luovuttaa niitä Planeetta Internetille.. Asiakas määrittelee sekä vastaa myös siitä, mitä henkilötietoja palveluun tallennettaan, mihin tarkoitukseen ja miten niitä käytetään, vaihdetaan tai käsitellään, kenelle tietoja luovutetaan sekä miten tiedon laadusta, ajantasaisuudesta ja poistamisesta tai anonymisoinnista huolehditaan. </p>
<p>Asiakas vastaa itse suorittamastaan henkilötietojen käsittelystä ja palvelun käytöstä. Asiakas on vastuussa myös henkilötietojen käsittelyn eheydestä, turvallisuudesta, ylläpidosta ja asianmukaisesta suojaamisesta sekä sen varmistamisesta, että Asiakas noudattaa kaikkia sovellettavia tietosuoja-, tietoturva- ja turvallisuuslakeja sekä määräyksiä.		</p>
<h2>Muut ehdot		</h2>
<p>Planeetta Internet ei ole vastuussa rekisterinpitäjälle mistään sopimusrikkomusten aiheuttamista välillisistä, epäsuorista vahingoista tai kolmansien esittämistä vaatimuksista. Näihin ehtoihin sovelletaan Planeetta Internetin yleisiin palveluehtoihin sisältyviä Planeetta Internetin enimmäisvastuun rajausta koskevia ehtoja.		</p>
<h2>Liitteen voimaantulo ja sopimuksen päättymisen vaikutukset </h2>
<p>Tämä liite tulee voimaan osapuolten välisen hosting-palvelusopimuksen voimaantulon yhteydessä ja pysyy voimassa kyseisen sopimuksen voimassaoloa koskevien ehtojen mukaisesti. </p>
<p>Kohtuullisen ajan kuluttua sopimuksen päätyttyä  henkilötietojen käsittelijä joko poistaa tai palauttaa kaikki henkilötiedot rekisterinpitäjälle ja poistaa olemassa olevat jäljennökset sekä poistaa tunnuksensa rekisterinpitäjän tietojärjestelmiin, paitsi jos unionin oikeudessa tai jäsenvaltion lainsäädännössä vaaditaan säilyttämään henkilötiedot. Siinä tapauksessa henkilötietojen käsittelijällä on oikeus säilyttää henkilötiedot lain vaatimusten mukaisesti, jatkamatta muutoin henkilötietojen käsittelyä ja noudattaen edelleen tässä liitteessä kuvattuja salassapitovelvoitteita. <strong>Koska henkilötietojen käsittelijä viime kädessä poistaa hallussaan olevat rekisterinpitäjän henkilötiedot sopimuksen päätyttyä, tulee rekisterinpitäjän ennen sopimuksen päättymistä varmistaa, että sillä on tarvittavat kopiot tai varmuuskopiot näistä tiedoista, mikäli se niitä edelleen tarvitsee sopimuksen päättymisen jälkeen.</strong><br />
</p>
<h2>KÄSITTELYÄ KOSKEVAT VAATIMUKSET</h2>
<p> <strong>Käsittelyn luonne:</strong> Henkilötietojen käsittely koskee Planeetta internetin tarjoamien palveluiden, kuten verkkosivustojen hosting-palvelun, tarjoamista ja toimittamista asiakkaalle. Planeetta Internet kerää, tallentaa ja käsittelee rekisterinpitäjänä toimivien asiakkaiden henkilötietoja sopimuksen, näiden ehtojen ja sovellettavan lainsäädännön mukaisesti. Koska asiakas yksinomaan päättää mitä henkilötietoja Planeetta Internetin palveluun tallennetaan eikä Planeetta Internet lähtökohtaisesti millään tavoin verifioi tai tarkista näitä tietoja (eikä sillä ole tähän velvollisuutta), voi asiakas tallentaa palveluun mitä tahansa tarpeelliseksi katsomiaan tietoja. Tyypillisesti kuitenkin Planeetta Internetin käsittelemät asiakkaan henkilötiedot saattavat koskea seuraavia henkilötietoryhmiä: nimi, sähköpostiosoite, markkinoinnin suostumukset ja kiellot, tilatut uutiskirjeet, verkkokaupan tilaushistoria ja muu verkkosivuston käyttöön liittyvä data. Tyypillisesti henkilötiedot koskevat seuraavia rekisteröityjen ryhmiä: asiakkaan omat asiakkaat (potentiaaliset ja nykyiset), asiakkaan verkkopalvelujen käyttäjät sekä asiakkaan uutiskirjeiden tilaajat. </p>
<h2>ALIHANKKIJAT HENKILÖTIETOJEN KÄSITTELYLLE</h2>
<p>Palveluiden päivittäiseen tuottamiseen ei pääsääntöisesti käytetä alihankkijoita. Mikäli alihankkijoita käytetään sovitaan asiasta asiakkaan kanssa erillisellä sopimuksella.</p>
<hr />
<h1>Planeetta Internet Oy Palveluita koskevat Erityiset Sopimusehdot 2010</h1>
<h2>1 Sopimusehtojen voimaantulo</h2>
<p>N&auml;m&auml; Erityiset Sopimusehdot tulevat voimaan 1.7.2010 ja ovat voimassa
toistaiseksi. N&auml;iden Erityisten Sopimusehtojen kanssa samanaikaisesti
tulevat voimaan Planeetta Internetin Yleiset Sopimusehdot. N&auml;m&auml; korvaavat
kaikki aikaisemmin voimassa olleet yleiset ja erityiset sopimusehdot.</p>
<p>N&auml;it&auml; sopimusehtoja sovelletaan 1.7.2010 j&auml;lkeen asiakkaiden
kanssa solmittaviin sopimuksiin. Vanhojen asiakkaiden jo voimassaoleviin sopimuksiin
n&auml;it&auml; sopimusehtoja sovelletaan 1.8.2010 lukien.</p>
<h2>2 Erityisten sopimusehtojen soveltaminen</h2>
<p>N&auml;it&auml; toimitusehtoja sovelletaan Planeetta Internet Oy:n tai sen
kanssa samaan konserniin kuuluvan yhti&ouml;n (j&auml;ljemp&auml;n&auml; Planeetta
Internet) asiakkaalle tarjoamiin palveluihin.</p>
<p>Ensisijaisesti asiakkaan ja Planeetta Internetin sopimussuhteessa tulevat
sovellettavaksi sopimus tai tilausvahvistus ja niiden liitteen&auml; oleva
palvelukuvaus, seuraavaksi n&auml;m&auml; ko. palvelua koskevat erityisehdot,
ja t&auml;m&auml;n j&auml;lkeen yleiset sopimusehdot soveltuvin osin.</p>
<h3>PALVELINVUOKRAUS JA HOSTING &ndash;PALVELUT SEK&Auml; PALVELINTILAN VUOKRAUS</h3>
<h2>3 Palvelinvuokraus ja Hosting-Palvelut</h2>
<p>3.1 Palvelinvuokrausta ja Hosting-palveluita koskevia ehtokohtia 3-7 sovelletaan
my&ouml;s, kun asiakkaan palveluun kuuluu palvelintilan vuokraus Planeetta
Internetin palvelimilla.</p>
<p>3.2 Planeetta Internet toimittaa Asiakkaalle toimivan palvelinj&auml;rjestelm&auml;n
ja/tai palvelinymp&auml;rist&ouml;n. Palvelimen tai palvelimien teknisist&auml; m&auml;&auml;ritelmist&auml;,
k&auml;ytt&ouml;j&auml;rjestelmist&auml; tai palvelinj&auml;rjestelmist&auml; sovitaan
tarkemmin sopimuksessa, tilausvahvistuksessa sek&auml; n&auml;iden liitteen&auml; olevassa
palvelukuvauksessa.</p>
<p>3.3 Asiakkaan kanssa voidaan sopia tietyst&auml; j&auml;rjestelmien ohjelmistojen
yll&auml;pitoehdoista ja vasteajoista vikojen korjaamisessa, mik&auml;li n&auml;ist&auml; ei
ole erikseen sovittu tarkemmin sopimuksessa, tilausvahvistuksessa sek&auml; n&auml;iden
liitteen&auml; olevassa palvelukuvauksessa, noudatetaan palveluiden tukeen
ja yll&auml;pidossa alla olevia sopimusm&auml;&auml;r&auml;yksi&auml; ja yleisi&auml; sopimusehtoja.</p>
<h3>Palvelun saatavuus, tuki ja yll&auml;pito</h3>
<p>3.4 Planeetta Internet yll&auml;pit&auml;&auml; palvelun k&auml;ytt&ouml;kunnossa
ja antaa asiakastukea n&auml;iden ehtojen mukaisesti, ellei asiakkaan kanssa
ole muuta sovittu.</p>
<p>3.5 Asiakas saa yll&auml;pit&auml;&auml;, muuttaa tai muokata laitteita
tai niihin liittyvi&auml; ohjelmistoja ilman Planeetta Internetin suostumusta,
jolloin asiakas vastaa itse tekemist&auml;&auml;n muutoksista ja asetuksista.</p>
<p>3.6 Mik&auml;li asiakkaan kanssa on sovittu tietyist&auml; vaste- ja korjausajoista
tai ns. full management palvelusta, jossa Planeetta Internet vastaa asiakkaan
j&auml;rjestelm&auml;n toimivuudesta, ei asiakas saa muuttaa laitteiston ja
k&auml;ytt&ouml;j&auml;rjestelm&auml;- palvelinohjelmistojen tai yll&auml;pidon
piirin sovittujen muiden ohjelmistojen asetuksia. Planeetta Internet ei vastaa
palvelun h&auml;iri&ouml;tt&ouml;myydest&auml;, jos asiakas tekee n&auml;it&auml; muutoksia.</p>
<p>3.7 Jos Planeetta Internet ei saa korjattua tai uudelleentoimitettua tai
korvattua palvelua kohtuullisessa ajassa, Planeetta Internet palauttaa asiakkaalle
palvelumaksun silt&auml; osin kuin palvelu ei ollut asiakkaan saatavilla johtuen
Planeetta Internetist&auml;. Planeetta Internet p&auml;&auml;tt&auml;&auml; korjaamisen,
uudelleentoimittamisen tai korvaamisen tavan, mutta se saattaa edellytt&auml;&auml; toimenpiteit&auml; my&ouml;s
asiakkaalta.</p>
<p>3.8 Vika katsotaan hyv&auml;ksytysti korjatuksi, kun palvelu osapuolten
yhteisess&auml; testiss&auml; toimii tai kun asiakas toteaa sen toimivan,
kuitenkin viimeist&auml;&auml;n viiden (5) ty&ouml;p&auml;iv&auml;n kuluttua
siit&auml;, kun Planeetta Internet ilmoitti sen toimivan.</p>
<p>3.9 Planeetta Internetill&auml; ei ole velvollisuutta korjata kolmannen
osapuolen tuottamissa ohjelmistoissa olevia virheit&auml;. Planeetta Internetill&auml; ei
my&ouml;sk&auml;&auml;n ole velvollisuutta korjata sellaisia vikoja ja h&auml;iri&ouml;it&auml;,
jotka johtuvat asiakkaan, muun k&auml;ytt&auml;j&auml;n tai kolmannen osapuolen
vastattavasta syyst&auml;, kuten palvelun virheellisest&auml; k&auml;yt&ouml;st&auml;,
huolimattomuudesta palvelun tai laitteiden k&auml;ytt&ouml;&auml; koskevien
ohjeiden noudattamisessa tai palvelun ja sopimuksen piiriin kuulumattomista
laitteista, ohjelmistoista, asetuksista, m&auml;&auml;rityksist&auml;, yhteyksist&auml;.</p>
<p>3.10 Jos asiakkaan ilmoittama vika tai h&auml;iri&ouml; ei kuulu Planeetta
Internetin huollon tai yll&auml;pidon piiriin, Planeetta Internetill&auml; on
oikeus veloittaa vian tai h&auml;iri&ouml;n etsimisest&auml; tai paikallistamisesta
kulloinkin voimassa olevan hinnastonsa mukainen maksu.</p>
<p>3.11 Planeetta Internet ei korvaa asiakkaalle sen tai asiakkaan palkkaaman
kolmannen osapuolen kustannuksia vianetsinn&auml;ss&auml; tai vikojen korvaamisessa.
N&auml;iss&auml; tapauksissa kumpikin on velvollinen kattamaan omat kulunsa.</p>
<h2>4 Versiot, muutokset palveluun</h2>
<p>4.1 Palvelu tukee rajoittua m&auml;&auml;r&auml;&auml; k&auml;ytt&ouml;j&auml;rjestelmi&auml; ja
vaatii tiettyj&auml; apuohjelmistoja mukaan lukien asiakasohjelmistot ja laitteet.
Tuetut laitteiden ja ohjelmistojen yhdistelm&auml;t saattavat muuttua sopimuksen
aikana. Planeetta Internet yll&auml;pit&auml;&auml; listaa tuetuista versioista
ja vaadituista komponenteista ja informoi n&auml;ist&auml; asiakasta.</p>
<p>4.2 Planeetta Internetill&auml; ei ole velvollisuutta toimittaa palvelua,
jos asiakas k&auml;ytt&auml;&auml; sellaista ohjelmistoa, ohjelmistoversiota,
laitetta tai muita asiakkaan hankittavaksi kuuluvia palvelun k&auml;ytt&auml;misen
edellytyksi&auml;, jotka eiv&auml;t ole soveltuvia palveluun.</p>
<p>4.3 Asiakkaan tulee sallia automaattiset p&auml;ivitykset. Mik&auml;li palvelun
p&auml;ivitys sit&auml; vaatii, asiakkaan on teht&auml;v&auml; version muutos
tai muu yll&auml;pitotoimi yhdess&auml; Planeetta Internetin kanssa. Jos Planeetta
Internet tekee sellaisia muutoksia, jotka normaalisti kuuluvat asiakkaan teht&auml;viksi,
Planeetta Internet laskuttaa asiakasta n&auml;ist&auml; toimista kulloinkin
voimassaolevan hinnastonsa mukaan.</p>
<p>4.4 Planeetta Internet voi muuttaa palvelua, mik&auml;li muutos on tarpeen
pakottavan lains&auml;&auml;d&auml;nn&ouml;n tai viranomaism&auml;&auml;r&auml;yksen
vuoksi, tai se johtuu laite- tai ohjelmistovalmistajan tuotteiden tai lisenssiehtojen
mahdollisista muutoksista.</p>
<p>4.5 Planeetta Internetill&auml; on oikeus muuttaa palveluiden teknist&auml; toteutusta
ja toiminnallisuutta siten, ett&auml; palvelun taso ei kokonaisuutena alennu.
Planeetta Internetill&auml; on oikeus lopettaa palvelun tai sen ominaisuuden
tuottaminen, mik&auml;li siihen on perusteltu syy ja jos palvelun kokonaistaso
ei olennaisesti heikkene.</p>
<p>4.6 Mik&auml;li asiakkaan valitseman k&auml;ytt&ouml;j&auml;rjestelm&auml;n
tai palvelinohjelmistojen ohjelmistotoimittajan tuki ko. ohjelmalle loppuu,
on Planeetta Internet oikeutettu korvaamaan n&auml;m&auml; ohjelmistot vastaavilla
toisilla ohjelmistoilla.</p>
<p>4.7 Planeetta Internetill&auml; on t&auml;ll&ouml;in (kohdat 4.4.-4.6.)
toissijaisesti my&ouml;s oikeus irtisanoa sopimus lopetettua palvelua tai
ominaisuutta koskevin osin ilmoittamalla t&auml;st&auml; asiakkaalle kohtuullisessa
ajassa etuk&auml;teen. Planeetta Internet ei vastaa asiakkaan laitteistojen,
ohjelmistojen tai muun toimintaymp&auml;rist&ouml;n mahdollisista muutoksista
tai muutoksiin liittyvist&auml; kustannuksista t&auml;llaisissa tapauksissa.</p>
<p>4.8 Mik&auml;li palveluymp&auml;rist&ouml;n muutos edellytt&auml;&auml; asiakkaan
tietojen siirt&auml;mist&auml; uuteen ohjelmisto- tai laiteymp&auml;rist&ouml;&ouml;n,
Planeetta Internet ilmoittaa asiakkaalle muutoksesta kaksi (2) kuukautta etuk&auml;teen.</p>
<p>4.9 Muutoin Planeetta Internet ilmoittaa muutoksista hyviss&auml; ajoin,
jos muutos vaikuttaa palveluun ja kun ilmoittaminen on kohtuudella mahdollista.</p>
<h2>5 P&auml;&auml;k&auml;ytt&auml;j&auml;tunnukset</h2>
<p>5.1 Asiakkaalle toimitetaan tilauksen toimituksen yhteydess&auml; Palvelimien
ja palvelinohjelmistojen p&auml;&auml;k&auml;ytt&auml;j&auml;tunnukset. Asiakas
vastaa p&auml;&auml;k&auml;ytt&auml;j&auml;tunnuksien k&auml;yt&ouml;st&auml; vastaavasti
kuin k&auml;ytt&auml;j&auml;tunnuksien ja salasanojen k&auml;yt&ouml;st&auml; (Yleiset
sopimusehdot kohta 15)</p>
<p>5.2 Planeetta Internet pit&auml;&auml; p&auml;&auml;k&auml;ytt&auml;j&auml;tunnukset
itsell&auml;&auml;n, jos Planeetta Internet on luvannut asiakkaalle sopimuksessa
tai tilausvahvistuksessa tietyn palvelun h&auml;iri&ouml;tt&ouml;myystason
tai ns. full management &ndash;palvelun.</p>
<p>5.3 Mik&auml;li asiakas pyyt&auml;&auml; edell&auml; (5.2.) mainitussa tapauksessa
k&auml;ytt&ouml;&ouml;n palvelimien ja palvelinohjelmistojen p&auml;&auml;k&auml;ytt&auml;j&auml;tunnukset
ja muuttaa palvelimien, k&auml;ytt&ouml;j&auml;rjestelm&auml;n tai palvelinohjelmiston
kokoonpanom&auml;&auml;rityksi&auml;, asetuksia tai muita m&auml;&auml;rityksi&auml;,
ei Planeetta Internet en&auml;&auml; voi vastata palvelun h&auml;iri&ouml;tt&ouml;m&auml;st&auml; toimivuudesta
ja palvelulle erikseen sopimuksessa, tilausvahvistuksessa tai palvelukuvauksessa
luvatuista vaste- ja korjausajoista.</p>
<h2>6 Asiakkaan laitteet ja ohjelmistot, H&auml;iri&ouml;t Planeetta Internetin
tai yleisen televerkon toimintaan</h2>
<p>6.1 Asiakas vastaa niiden laitteiden, teleyhteyksien ja ohjelmistojen hankkimisesta
ja toimintakunnosta, jotka eiv&auml;t sis&auml;lly palvelukuvauksen tai sopimuksen
mukaiseen palveluun.</p>
<p>6.2 Planeetta Internet ei vastaa asiakkaan laitteiden tai ohjelmien toimivuudesta,
suojauksista tai yhteensopivuudesta palveluun.</p>
<p>6.3 Asiakas vastaa my&ouml;s siit&auml;, ett&auml; n&auml;m&auml; laitteet
tai ohjelmistot ovat hyv&auml;ksyttyj&auml;, eiv&auml;tk&auml; haittaa tai
h&auml;iritse Planeetta Internetin toimintaa tai televerkon liikennett&auml;.
H&auml;iri&ouml;it&auml; mahdollisesti tuottavat laitteet tai ohjelmistot
on v&auml;litt&ouml;m&auml;sti irrotettava palvelusta.</p>
<h3>Open Source &ndash;ohlelmistot</h3>
<p>6.4 Asiakkaan tulee olla erityisen huolellinen k&auml;ytt&auml;ess&auml;&auml;n
avoimen l&auml;hdekoodin (Open Source) ohjelmistoja ja varmistua niiden p&auml;ivityksist&auml;.
Asiakas vastaa Planeetta Internetin palvelimille asentamistaan ohjelmista
ja vastaa niiden aiheuttamista tietoturvariskeist&auml; ja mahdollisista haittaohjelmista.</p>
<p>6.5 Planeetta Internetill&auml; on oikeus poistaa tai est&auml;&auml; t&auml;llaisten
haittaa tai tietoturvariskej&auml; aiheuttavien ohjelmien k&auml;ytt&ouml; palvelimillaan.</p>
<p>6.6 Jos asiakas k&auml;ytt&auml;&auml; Planeetta Internetin palveluissa
tai verkossa viallisia tai h&auml;iri&ouml;it&auml; aiheuttavia laitteita
tai ohjelmistoja, asiakas on velvollinen korvaamaan vikojen etsimisest&auml;,
niiden rajoittamisen sek&auml; kolmannelle mahdollisesti aiheutuneen vahingon.</p>
<h2>7 Asiakkaan tarvitsemien lisenssien ja k&auml;ytt&ouml;oikeuksien hankkiminen
ja yll&auml;pito</h2>
<p>7.1 Planeetta Internet vastaa siit&auml;, ett&auml; sen palvelukuvauksen
mukaiseen palveluun kuuluvien k&auml;ytt&ouml;j&auml;rjestelmien ja ohjelmistojen
yll&auml;pitoon ja asiakkaalle tarvittavat lisenssit ja k&auml;ytt&ouml;oikeudet
ovat asianmukaiset ja niiden lisenssimaksut on maksettu lisenssinhaltijalle.</p>
<p>7.2 Asiakkaan tulee ilmoittaa Planeetta Internetille ohjelmistojen k&auml;ytt&auml;jien
m&auml;&auml;r&auml; ja/tai siit&auml; kuinka monelta ty&ouml;asemalta Planeetta
Internetin asiakkaalle tarjoamia ohjelmistoja k&auml;ytet&auml;&auml;n sek&auml; n&auml;iden
m&auml;&auml;rien muutoksista niiss&auml; tapauksissa, joissa lisenssimaksut
maksetaan k&auml;ytt&auml;jien m&auml;&auml;r&auml;n tai k&auml;yt&ouml;ss&auml; olevien
ty&ouml;asemien mukaan.</p>
<p>7.3 Asiakas vastaa siit&auml;, ett&auml; sen Planeetta Internetin palvelimilla
ja muissa palveluissa asiakkaan itse tilaamien tai asentamien k&auml;ytt&ouml;j&auml;rjestelmien
ja palvelinohjelmistojen ja muiden asiakkaan k&auml;ytt&auml;mien ohjelmistojen
k&auml;ytt&ouml;&ouml;n ja yll&auml;pitoon tarvittavat lisenssit ja k&auml;ytt&ouml;oikeudet
ovat asianmukaiset ja niiden lisenssimaksut on maksettu lisenssinhaltijalle.</p>
<p>7.4 Jos viranomainen, lisenssien haltija tai n&auml;iden etuja valvoja kolmas
osapuoli osoittaa, ett&auml; asiakkaan Planeetta Internetin palvelimilla tai
palveluissa k&auml;ytt&auml;m&auml;t ohjelmistot ja niiden k&auml;ytt&ouml;oikeudet
eiv&auml;t ole asianmukaiset tai niiden lisenssimaksut ovat maksamatta, Planeetta
Internetill&auml; on asiakasta kuultuaan oikeus poistaa tai est&auml;&auml; luvattomien
tai lisensioimattomien ohjelmistojen k&auml;ytt&ouml; palvelimillaan ja palveluissaan.</p>
<p>7.5 Yll&auml; mainituissa tilanteissa Planeetta Internetill&auml; on oikeus
veloittaa asiakkaalta hinnastonsa mukaiset kustannukset selvitysty&ouml;st&auml;&auml;n.</p>
<p>7.6 Koska Planeetta Internet ei valvo asiakkaan k&auml;ytt&auml;mien ohjelmistojen
ja k&auml;ytt&ouml;oikeuksien asianmukaisuutta, Planeetta Internet ei vastaa
my&ouml;sk&auml;&auml;n vastaa asiakkaiden k&auml;ytt&auml;mien ohjelmistojen
ja k&auml;ytt&ouml;oikeuksien toimivuudesta taikka lainmukaisuudesta.</p>
<h2>8 Tekij&auml;noikeutta loukkaava tai laiton aineisto</h2>
<p>8.1 Planeetta Internet ei valvo sen hallinnassa olevassa viestint&auml;verkossa
v&auml;litett&auml;v&auml;&auml; aineistoa, eik&auml; voi puuttua aineiston
sis&auml;lt&ouml;&ouml;n, eik&auml; my&ouml;sk&auml;&auml;n voi est&auml;&auml; p&auml;&auml;sy&auml; verkkosivuilla
olevaan aineistoon, ellei siit&auml; ole lains&auml;&auml;d&auml;nn&ouml;ss&auml; erikseen
m&auml;&auml;r&auml;tty.</p>
<p>8.2 Sananvapauslakiin ja lakiin tietoyhteiskunnan palveluiden tarjoamisesta
sis&auml;ltyy poikkeuss&auml;&auml;nn&ouml;kset, jotka koskevat verkkosivuilla
olevaa aineistoa. Hosting-palvelua tarjoavalla teleyrityksell&auml; on tuomioistuimen
m&auml;&auml;r&auml;yksen perusteella velvollisuus keskeytt&auml;&auml; julkaistun
verkkoviestin jakelu, jos viestin sis&auml;ll&ouml;n perusteella on ilmeist&auml;,
ett&auml; sen pit&auml;minen yleis&ouml;n saatavilla on s&auml;&auml;detty
rangaistavaksi.</p>
<p>8.3 Laissa tietoyhteiskunnan palveluiden tarjoamisesta erikseen s&auml;&auml;detyiss&auml; tilanteissa,
jotka eiv&auml;t edellyt&auml; tuomioistuimen p&auml;&auml;t&ouml;st&auml; ja
jotka koskevat tekij&auml;noikeudella suojattua aineistoa ja tiettyj&auml; vakavia
rikoksia. Hosting &ndash;palvelua tarjoava teleyritys voi oma-aloitteisesti
est&auml;&auml; p&auml;&auml;syn omalla palvelimellaan olevaan aineistoon
seuraavissa tapauksissa:</p>
<p>a) teleyritys saa lain edellytykset t&auml;ytt&auml;v&auml;n ilmoituksen
siit&auml;, ett&auml; aineisto loukkaa tekij&auml;noikeutta, tai</p>
<p>b) se saa tosiasiallisesti tietoonsa, ett&auml; tallennettu aineisto on
ilmeisesti rikoslain 11 luvun 8 &sect;:n tai 17 luvun 18 &sect;:n vastaista
(liittyv&auml;t lapsipornoon, v&auml;kivaltaan ja rasismiin).</p>
<p>8.4 Jos Planeetta Internet j&auml;lkimm&auml;isell&auml; perusteella poistaa
aineiston omalta palvelimeltaan, sen tulee viipym&auml;tt&auml; ilmoittaa
asiasta sis&auml;ll&ouml;n tuottajalle, jolla on oikeus vied&auml; asia tuomioistuimen
k&auml;sitelt&auml;v&auml;ksi.</p>
<h3>Vertaisverkkoliikenne</h3>
<p>8.5 Tekij&auml;noikeuslain mukaan tuomioistuin voi tekij&auml;noikeuden
haltijan tai t&auml;m&auml;n edustajan hakemuksesta m&auml;&auml;r&auml;t&auml; Teleyrityksen
(Planeetta Internetin) keskeytt&auml;m&auml;&auml;n tekij&auml;noikeutta loukkaavaksi
v&auml;itetyn aineiston saattamisen yleis&ouml;n saataviin sakon uhalla.</p>
<h3>Lapsipornoaineiston suodattaminen</h3>
<p>8.6 Planeetta Internetill&auml; on oikeus est&auml;&auml; p&auml;&auml;sy
poliisiviranomaisten ilmoittamille verkkosivuille, joissa viranomaisen tietojen
mukaan on lapsipornoaineistoa. T&auml;m&auml; saattaa est&auml;&auml; p&auml;&auml;syn
my&ouml;s sivuille, joissa ei ole lapsipornoaineistoa. Suodatusta koskeviin
tiedusteluihin vastaa ensisijaisesti poliisiviranomainen.</p>
<h3>LAAJAKAISTA JA YHTEYSTUOTTEET</h3>
<h2>9 Planeetta Internet Laajakaista-palvelu</h2>
<p>9.1 Planeetta Internet Laajakaista-palvelu on yritykselle tai yhteis&ouml;lle
tarkoitettu, kiinte&auml;hintainen laajakaistayhteys. Palvelu sis&auml;lt&auml;&auml; kulloinkin
valitulla tekniikalla toteutettavan yhteyden asiakkaalta Planeetta Internetin
IP &ndash;palveluverkkoon sek&auml; yhteyden Planeetta Internetin IP -palveluverkosta
internetiin. sek&auml; erilaisia sis&auml;lt&ouml;palveluita.</p>
<p>9.2 Laajakaistapalveluiden sis&auml;lt&ouml; sek&auml; tekniset ominaisuudet
ja m&auml;&auml;ritelm&auml;t m&auml;&auml;ritell&auml;&auml;n erikseen tarkemmin
sopimuksessa, tilausvahvistuksessa tai palvelukuvauksessa.</p>
<p>9.3 Planeetta Internetill&auml; on oikeus valita yhteyden tekninen toteuttamistapa
sek&auml; muuttaa yhteyden toteuttamistapaa, jos siit&auml; ei aiheudu asiakkaalle
palvelutason laskua.</p>
<h2>10 Modeemit, p&auml;&auml;telaitteet ja muut asiakkaan k&auml;ytt&ouml;&ouml;n
annettavat laitteet</h2>
<p>10.1 Planeetta Internet Laajakaista palvelun modeemit ja muut asiakkaalle
toimitettavat p&auml;&auml;telaiteet kuuluvat oleellisena osana palveluun.</p>
<p>10.2 Asiakkaan on k&auml;ytett&auml;v&auml; ja s&auml;ilytett&auml;v&auml; laitteita
huolellisesti. Asiakkaan on korvattava Planeetta Internetille v&auml;litt&ouml;m&auml;t
vahingot jos Planeetta Internetin omistama laite vikaantuu asiakkaan huolimattoman
k&auml;yt&ouml;n seurauksena, varastetaan tai katoaa.</p>
<p>10.3 Asiakkaalla ei ole oikeutta luovuttaa laitetta kolmannen osapuolen
k&auml;ytt&ouml;&ouml;n tai siirt&auml;&auml; laitetta toiseen asennusosoitteeseen
ilman Planeetta Internetin suostumusta.</p>
<h3>P&auml;&auml;telaitteiden asennukset ja m&auml;&auml;ritykset</h3>
<p>10.4 Laitteen asennuksesta Planeetta Internetin palveluihin ja verkkoon
vastaa Planeetta Internet, joka vastaa my&ouml;s laiteasetuksista ja m&auml;&auml;rityksist&auml;.</p>
<p>10.5 Mik&auml;li asiakas asentaa p&auml;&auml;telaitteen itse tai hankkii
asennuksen muulta toimittajalta, Planeetta Internet voi asiakkaan pyynn&ouml;st&auml; suorittaa
asennuksen testaamisen kulloinkin voimassa olevan palveluhinnaston mukaista
maksua vastaan</p>
<p>10.6 Asiakas saa muuttaa p&auml;&auml;telaitteen ohjelmistoja ja asetuksia
ilman Planeetta Internetin suostumusta, jolloin asiakas vastaa itse tekemist&auml;&auml;n
muutoksista ja asetuksista.</p>
<p>10.7 Planeetta Internetill&auml; on oikeus automaattisesti p&auml;ivitt&auml;&auml; laitteen
ohjelmistoa ja muuttaa asetuksia. Planeetta Internet voi vaihtaa laitteen
vian todettuaan samanlaiseen tai samankaltaiseen laitteeseen.</p>
<p>10.8 Asiakas vastaa Planeetta Internet Laajakaistapalvelun vikaan liittyv&auml;n
huoltok&auml;ynnin kustannuksista, mik&auml;li Planeetta Internet havaitsee
vian johtuvan p&auml;&auml;telaitteesta, joka ei ole Planeetta Internetin
toimittama taikka asennuksesta tai muutoksista, jotka ovat muun kuin Planeetta
Internetin asentajan suorittama.</p>
<h2>11 Laajakaista ja yhteystuotteisiin sovelletaan lis&auml;ksi seuraavaa</h2>
<p>11.1 Asiakas vastaa siit&auml;, ett&auml; Palvelun k&auml;ytt&ouml;&ouml;n
tarvitseman liittym&auml;&auml;n k&auml;ytett&auml;viss&auml; on kiinteist&ouml;n
sis&auml;verkko-osuus, jonka tulee olla kulloinkin voimassa olevien teknisten
m&auml;&auml;r&auml;ysten mukainen ja asianmukaisesti dokumentoitu.</p>
<p>11.2 Asiakas vastaa liittym&auml;n tarvitsemasta s&auml;hk&ouml;nsaannista.</p>
<p>11.3 Jos liittym&auml;n rakentamisesta tai siirt&auml;misest&auml; toiseen
osoitteeseen aiheutuu erityisi&auml; kustannuksia, on asiakas velvollinen
korvaamaan ne.</p>
<p>11.4 Planeetta Internetill&auml; on oikeus kielt&auml;yty&auml; palvelun
toimittamisesta, mik&auml;li asiakkaan kiinteist&ouml;n tai kiinteist&ouml;-
tai asuntoosakeyhti&ouml;n tai yrityksen sis&auml;verkko ovat puutteelliset
tai mik&auml;li toimitus ei esimerkiksi toisen teleyrityksen tietoliikenneverkon
puuttuvan kapasiteetin vuoksi ole mahdollista.</p>
<h2>12 Yhteysnopeus</h2>
<p>12.1 Planeetta Internetin ilmoittama nopeus eri laajakaistapalveluille on
aina nimellisnopeus (teoreettinen maksiminopeus optimaalisessa tilanteessa).</p>
<p>12.2 Tietoliikenneverkon yht&auml;aikaisten k&auml;ytt&auml;jien lukum&auml;&auml;r&auml;st&auml; tms.
johtuvista syist&auml; saattaa verkon nopeus laskea ilmoitetusta maksimaalisesta
nimellisnopeudesta.</p>
<p>12.3 Planeetta Internet pyrkii pit&auml;m&auml;&auml;n laajakaistapalvelun
asiakkaalle tarjottavan tietoliikennekapasiteetin riitt&auml;v&auml;n&auml;.</p>
<h3>PLANEETTA INTERNET KOTISIVUPALVELUIDEN ERITYISET SOPIMUSEHDOT</h3>
<h2>13 Planeetta Internet Kotisivut -palvelu</h2>
<p>13.1 Planeetta Internet Kotisivut palvelulla tarkoitetaan Planeetta Internetin
palveluna tuottamaa palvelukokonaisuutta, johon kuuluu Planeetta Internetin
asiakkaalle toimittama kotisivujen tekemiseen ja julkaisemiseen tarkoitetun
ohjelman (Kotisivut &ndash;ohjelmisto) k&auml;ytt&ouml;oikeuden ja muita palveluita,
jotka on m&auml;&auml;ritelty erikseen palvelukuvauksessa.</p>
<p>13.2 Planeetta Kotisivut palvelu toteutetaan Planeetta Internetin tarjoamalla
palvelualustalla ja Planeetta Internetin palvelimilla. Planeetta Internet
ei voi taata palvelun toimivuutta muilla palvelualustoilla.</p>
<h2>14 Planeetta Internet Kotisivut ohjelman k&auml;ytt&ouml;oikeus</h2>
<p>14.1 Tekij&auml;noikeus ja muut immateriaalioikeudet Kotisivut - ohjelmistoon,
graafiseen ulkoasuun ja muihin Planeetta Internetin toteuttamiin toiminnallisiin
ratkaisuihin kuuluvat Planeetta Internetille. Immateriaalioikeuksiin sovelletaan
muutoin Yleisten Sopimusehtojen kohtaa 18.</p>
<p>14.2 Asiakkaalle ei toimiteta ohjelman l&auml;hdekoodia</p>
<p>14.3 Asiakas saa k&auml;ytt&ouml;oikeuden sopimuksen Kotisivut - ohjelmiston
tekohetkell&auml; olevaan ohjelmaversioon tai vastaavaan ohjelmaan ja niihin
tulevien uudistusten tai korvaavien ohjelmaversioiden k&auml;ytt&ouml;oikeuden
k&auml;ytt&ouml;&ouml;nottomaksua ja k&auml;ytt&ouml;oikeus- ja yll&auml;pitomaksua
vastaan. K&auml;ytt&ouml;oikeuden ehdot m&auml;&auml;ritell&auml;&auml;n alla
kohdissa 14.4-14.7.</p>
<p>14.4 Asiakas saa Kotisivut -ohjelmistoon omaa sis&auml;ist&auml; toimintaansa
koskevan yrityskohtaisen k&auml;ytt&ouml;oikeuden, jota asiakas ei saa siirt&auml;&auml; tai
muuten luovuttaa kolmannelle ilman Planeetta Internetin etuk&auml;teen antamaa
kirjallista suostumusta.</p>
<p>14.5 Asiakas saa k&auml;ytt&auml;&auml; Kotisivut -ohjelmistoa yksien kotisivujen
laatimiseen ja yll&auml;pit&auml;miseen. Kotisivuja ei saa monistaa muihin
tarkoituksiin.</p>
<p>14.6 Asiakkaalla ei ole oikeutta k&auml;ytt&auml;&auml; Kotisivut -ohjelmistoa
tarjotakseen ko. ohjelmiston k&auml;ytt&auml;mist&auml; koskevia toimintoja
tai k&auml;ytt&ouml;palveluita kolmansille ilman Planeetta Internetin etuk&auml;teen
antamaa kirjallista suostumusta.</p>
<p>14.7 Sopimuksen mukaisen yll&auml;pidon tai sopimuksen muutoin p&auml;&auml;ttyess&auml; p&auml;&auml;ttyy
my&ouml;s asiakkaan k&auml;ytt&ouml;oikeus Kotisivut - ohjelmistolle, ellei
kirjallisesti muuta sovita.</p>
<h2>15 Planeetta Internetin asiakkaalle tekem&auml;t kotisivut</h2>
<p>15.1 Planeetta Internet voi toimittaa asiakkaalle asiakaskohtaisesti r&auml;&auml;t&auml;l&ouml;idyt
kotisivut palvelukuvauksessa m&auml;&auml;ritellyn mukaisesti.</p>
<p>15.2 Kotisivujen ja asiakkaan julkaisuj&auml;rjestelmien yll&auml;pidosta
sovitaan erikseen ja asiakkaan toimittaman aineiston muokkaamisesta veloitetaan
erikseen.</p>
<p>15.3 Tekij&auml;noikeus ja muut immateriaalioikeudet Kotisivut - ohjelmistoon,
graafiseen ulkoasuun ja muihin Planeetta Internetin toteuttamiin toiminnallisiin
ratkaisuihin kuuluvat Planeetta Internetille. Immateriaalioikeuksiin sovelletaan
muutoin Yleisten Sopimusehtojen kohtaa 19.</p>
<p>15.4 Asiakkaalle ei toimiteta ohjelman l&auml;hdekoodia</p>
<p>15.5 Asiakas saa k&auml;ytt&ouml;oikeuden toimitettuihin kotisivuihin sek&auml; muihin
projektin perusteella syntyviin asiakirjoihin ja tuloksiin sek&auml; niihin
tehtyihin muutoksiin k&auml;ytt&ouml;oikeuden k&auml;ytt&ouml;&ouml;nottomaksua
ja k&auml;ytt&ouml;oikeus- ja yll&auml;pitomaksua vastaan. K&auml;ytt&ouml;oikeuden
ehdot m&auml;&auml;ritell&auml;&auml;n alla kohdissa 15.6-15.9.</p>
<p>15.6 Asiakkaalla on oikeus k&auml;ytt&auml;&auml; kotisivuja ja projektin
tuloksena syntyvi&auml; asiakirjoja ja muita tuloksia omassa sis&auml;isess&auml; toiminnassaan.</p>
<p>15.7 Mik&auml;li asiakas tekee itse tai teett&auml;&auml; kolmannella osapuolella
muutoksia Planeetta Internetin toimittamiin kotisivuihin, joita Planeetta
Internet ei ole kirjallisesti hyv&auml;ksynyt, ei Planeetta Internet vastaa
en&auml;&auml; kotisivujen toimivuudesta.</p>
<p>15.8 Asiakkaalla ei ole oikeutta siirt&auml;&auml; tai monistaa kotisivuja
tai projektin tuloksena syntyvi&auml; asiakirjoja ja muita tuloksia kolmannelle
eik&auml; muutenkaan siirt&auml;&auml; k&auml;ytt&ouml;oikeutta tai muutoin</p>
<p>15.9 T&auml;ll&auml; sopimuksella ei ole vaikutusta oikeuksiin, jotka liittyv&auml;t
niihin aineistoihin, jotka sopijapuolet luovuttavat toisilleen asiakaskohtaisten
kotisivujen tekemist&auml; varten.</p>
<p>15.10 Asiakas vastaa siit&auml;, ett&auml; asiakkaan vastuulla olevat teht&auml;v&auml;t
tehd&auml;&auml;n sopimuksen mukaisesti ja huolellisesti. Asiakkaan tulee
antaa Planeetta Internetille riitt&auml;v&auml;t ja oikeat tiedot projektiin
kuuluvien t&ouml;iden tekemist&auml; varten sovitun mukaisesti.</p>
<p>15.11 Asiakas vastaa Planeetta Internetille antamistaan tiedoista ja ohjeista
sek&auml; sopimuksen mukaisesti tehtyjen asiakaskohtaisten kotisivujen soveltuvuudesta
asiakkaan k&auml;ytt&ouml;tarkoitukseen.</p>
<h2>16 Asiakkaan tilaamien kotisivujen hyv&auml;ksyminen</h2>
<p>16.1 Sopijapuolet voivat erikseen sopia osatoimitusten hyv&auml;ksymisist&auml;.
Jollei muuta ole sovittu, noudatetaan my&ouml;s osatoimitusten testauksen
ja hyv&auml;ksymisen osalta kohtien 16.2-16.7 mukaista menettely&auml;.</p>
<p>16.2 Ellei kirjallisesti ole toisin sovittu toimittajan tekemist&auml; testeist&auml;,
toimittaja tekee kotisivuille k&auml;yt&auml;nt&ouml;ns&auml; mukaisesti testit.</p>
<p>16.3 Asiakas tekee kotisivujen hyv&auml;ksymistestin sopimuksen mukaisessa
k&auml;ytt&ouml;ymp&auml;rist&ouml;ss&auml;.</p>
<p>16.4 Asiakkaan tulee ilmoitta kotisivujen hyv&auml;ksymisest&auml; seitsem&auml;n
(7) p&auml;iv&auml;n kuluessa siit&auml;, kun Planeetta Internet on luovuttanut
kotisivut asiakkaalle hyv&auml;ksymistestin tekemist&auml; varten. Asiakkaan
on viivytyksett&auml; ilmoitettava toimittajalle kirjallisesti toimituksessa
havaitut virheet riitt&auml;v&auml;n yksil&ouml;idysti.</p>
<p>16.5 Sellaiset virheet, jotka eiv&auml;t olennaisesti haittaa kotisivujen
k&auml;ytt&auml;mist&auml;, eiv&auml;t ole esteen&auml; kotisivujen toimituksen
hyv&auml;ksymiselle, mutta Planeetta Internet on velvollinen ilman aiheetonta
viivytyst&auml; korjaamaan ne.</p>
<p>16.6 Kotisivujen toimitus katsotaan hyv&auml;ksytyksi,</p>
<p>a) kun Planeetta Internet on korjannut asiakkaan hyv&auml;ksymistestin aikana
kirjallisesti raportoimat hyv&auml;ksymisen est&auml;v&auml;t virheet ja puutteet
tai</p>
<p>b) jos asiakas ei tee kirjallista huomautusta hyv&auml;ksymisen est&auml;v&auml;st&auml; virheest&auml; tai
puutteesta seitsem&auml;n (7) p&auml;iv&auml;n kuluessa siit&auml;, kun Planeetta
Internet on luovuttanut kotisivut asiakkaalle hyv&auml;ksymistestin tekemist&auml; varten,
taikka</p>
<p>c) jos asiakas ottaa kotisivut tuotantok&auml;ytt&ouml;&ouml;n.</p>
<p>16.7 Toimitus katsotaan kokonaisuudessaan hyv&auml;ksytyksi, kun kotisivut
ja toimitukseen sis&auml;ltyv&auml;n dokumentaation toimitus on hyv&auml;ksytty
sek&auml; kun muut toimitukseen sis&auml;ltyv&auml;t teht&auml;v&auml;t on
sopimuksen mukaisesti tehty.</p>
<h3>PLANEETTA VERKKOKAUPPA OHJELMISTON ERITYISET SOPIMUSEHDOT</h3>
<h2>17 Planeetta Internet Verkkokauppa -palvelut</h2>
<p>17.1 Planeetta Internet Verkkokauppapalvelulla tarkoitetaan Planeetta Internetin
asiakkailleen palveluna tuottamaa palvelukokonaisuutta, johon kuuluu</p>
<p>17.1.1 m&auml;&auml;ritelty tila tai tallennuskapasiteetti Planeetta Internetin
palvelimilla, jolloin sovelletaan n&auml;iden ehtojen kohtia 3-7,</p>
<p>17.1.2 Planeetta Internetin Planeetta Verkkokauppa ohjelmiston k&auml;ytt&ouml;oikeus.
ja</p>
<p>17.1.3 muita palveluita, jotka on m&auml;&auml;ritelty erikseen sopimuksessa,
tilausvahvistuksessa tai palvelukuvauksessa.</p>
<h2>18 Planeetta Verkkokauppa ohjelmisto ja sen yll&auml;pito</h2>
<p>18.1 Planeetta Internet toimittaa Asiakkaan k&auml;ytt&ouml;&ouml;n Planeetta
Verkkokauppa ohjelmiston tai vastaavan ohjelmiston, jota Asiakas voi hy&ouml;dynt&auml;&auml; kaupallisessa
toiminnassaan.</p>
<p>18.2 Planeetta Internet voi muuttaa Planeetta Verkkokauppa ohjelmistoa ja
sen toiminnallisia ominaisuuksia. Ohjelmistoa p&auml;ivitet&auml;&auml;n s&auml;&auml;nn&ouml;llisesti
uusilla ohjelmistoversioilla ja toiminnollisilla parannuksilla.</p>
<p>18.3 Planeetta Internet ei ole velvollinen toteuttamaan asiakkaan antamia
ty&ouml;m&auml;&auml;r&auml;yksi&auml; koskien Verkkokauppa ohjelmistoa tai
asiakkaan verkkokaupan sis&auml;lt&ouml;&auml; tai toiminnallisuutta, pois
lukien ohjelmiston selke&auml;t toimintavirheet</p>
<p>18.4 Planeetta Verkkokauppa ohjelmisto on suunniteltu toimimaan Planeetta
Internetin tarjoamalla palvelualustalla ja Planeetta Internetin palvelimilla.
Planeetta Internet ei voi taata palvelun toimivuutta muilla palvelualustoilla
tai muissa k&auml;ytt&ouml;ymp&auml;rist&ouml;ss&auml;.</p>
<p>18.5 Johtuen alan kehityksest&auml; Verkkokauppa ohjelmiston k&auml;ytett&auml;vyys
eri k&auml;ytt&ouml;j&auml;rjestelmiss&auml; saattaa muuttua, johtuen mm.
k&auml;ytt&ouml;j&auml;rjestelmien ja ohjelmien p&auml;ivityksist&auml; ja
muutoksista. Planeetta Internet varaa oikeuden muuttaa ohjelmiston teknist&auml; toteutusta
ja ominaisuuksia n&auml;iden muutosten vuoksi</p>
<p>18.6 Asiakkaalle ilmoitetaan ohjelmistoon tulevista p&auml;ivityksist&auml; ja
toiminnallisista muutoksista hyviss&auml; ajoin ennen muutosten voimaan tulemista
s&auml;hk&ouml;postitse ja Planeetta Internetin asiakaspalvelusivustolla.</p>
<h2>19 Planeetta Verkkokauppa ohjelmiston k&auml;ytt&ouml;oikeudet</h2>
<p>19.1 Tekij&auml;noikeus ja muut immateriaalioikeudet Planeetta Verkkokauppa
ohjelmistoon, graafiseen ulkoasuun ja muihin toteuttamiinsa toiminnallisiin
ratkaisuihin kuuluvat Planeetta Internetille. Immateriaalioikeuksiin sovelletaan
muutoin Yleisten Sopimusehtojen kohtaa 18.</p>
<p>19.2 Asiakkaalle ei toimiteta ohjelman l&auml;hdekoodia.</p>
<p>19.3 Asiakas saa k&auml;ytt&ouml;oikeuden sopimuksen tekohetkell&auml; olevaan
Planeetta Verkkokauppa ohjelmaversioon tai vastaavaan ohjelmistoon ja niihin
tulevien uudistusten tai korvaavien ohjelmaversioiden k&auml;ytt&ouml;oikeuden
k&auml;ytt&ouml;&ouml;nottomaksua ja k&auml;ytt&ouml;oikeus- ja yll&auml;pitomaksua
vastaan. K&auml;ytt&ouml;oikeuden ehdot m&auml;&auml;ritell&auml;&auml;n alla
kohdissa 19.4 &ndash; 19.7.</p>
<p>19.4 Asiakas saa Planeetta Verkkokauppa ohjelmistoon omaa sis&auml;ist&auml; toimintaansa
koskevan yrityskohtaisen k&auml;ytt&ouml;oikeuden, jota asiakas ei saa siirt&auml;&auml; tai
muuten luovuttaa kolmannelle ilman Planeetta Internetin etuk&auml;teen antamaa
kirjallista suostumusta.</p>
<p>19.5 Asiakas saa k&auml;ytt&auml;&auml; Planeetta Verkkokauppa ohjelmaa
yhden verkkokaupan toteuttamiseen ja yll&auml;pit&auml;miseen Suomessa. Verkkokauppaa
ei saa monistaa muihin tarkoituksiin.</p>
<p>19.6 Asiakkaalla ei ole oikeutta k&auml;ytt&auml;&auml; Planeetta Verkkokauppa
ohjelmistoa tarjotakseen ko. ohjelmiston k&auml;ytt&auml;mist&auml; koskevia
toimintoja tai k&auml;ytt&ouml;palveluita kolmansille ilman Planeetta Internetin
etuk&auml;teen antamaa kirjallista suostumusta.</p>
<p>19.7 Sopimuksen mukaisen ohjelmiston yll&auml;pidon tai sopimuksen muutoin
p&auml;&auml;ttyess&auml; p&auml;&auml;ttyy my&ouml;s asiakkaan k&auml;ytt&ouml;oikeus
Planeetta Internetin toimittamalle Planeetta Verkkokauppa ohjelmistolle, ellei
kirjallisesti muuta sovita.</p>
<h2>20 Asiakkaan teht&auml;v&auml;t ja vastuut</h2>
<p>20.1 Asiakas vastaa Planeetta Verkkokauppa ohjelmiston k&auml;ytt&ouml;&ouml;notosta
sek&auml; ohjelmiston avulla toteuttamansa verkkokaupan toiminnasta sek&auml; haluamistaan
muutoksista Verkkokaupan graafiseen ulkoasuun ja toiminnallisuuteen ja muihin
ominaisuuksiin</p>
<p>20.2 Asiakas vastaa my&ouml;s Planeetta Verkkokauppa ohjelmistolla toteuttamansa
verkkokauppapalvelun integroinnista omiin tietoj&auml;rjestelmiins&auml; ja
k&auml;ytt&auml;miins&auml; kaupan taustaj&auml;rjestelmiin (m. kassa- tai
myym&auml;l&auml;j&auml;rjestelm&auml;t, varasto-ohjelmat yms.) sek&auml; n&auml;ist&auml; aiheutuneista
kuluista.</p>
<p>20.3 Asiakas vastaa itse tarvitsemiensa verkkopankkisopimusten ja muiden
verkkomaksutapojen tarvitsemien sopimusten tekemisest&auml; kolmansien osapuolten
kanssa sek&auml; valitsemiensa verkkomaksutapojen vaatimista muutoksista toteuttamaansa
verkkokauppapalveluun ja Planeetta Verkkokauppa ohjelmistoon.</p>